{
  "glossary": [
    {
      "title": "Accessible et activable par le clavier et tout dispositif de pointage",
      "body": "<ul> <li>Un composant d’interface (lien, bouton…) est accessible au clavier et par tout dispositif de pointage lorsque l’utilisateur peut prendre, indifféremment, le focus par un pointeur ou la touche tabulation ;</li> <li>Un composant d’interface (lien, bouton…) est activable au clavier et par tout dispositif de pointage lorsque l’utilisateur peut enclencher, indifféremment, l’action prévue par le composant d’interface par une pression du pointeur ou la touche entrée du clavier ;</li> <li>Attention : pour certains composants d’interface comme les <span lang=\"en\"><code>sliders</code></span> (bouton coulissant ou rotatif…), il n’est pas possible de contrôler le composant par la seule touche d’entrée. Dans ces situations, d’autres touches (comme les touches de direction) peuvent être utilisées. En particulier pour les éléments ayant un rôle WAI-ARIA correspondant à un motif de conception il est recommandé de considérer le document <span lang=\"en\"><a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a></span> lors de leur implémentation.</li> </ul> <p>Dans le référentiel, l’expression « contrôlable par le clavier et tout dispositif de pointage » se rapporte également à la présente définition.</p> <p>Note importante : le recours à certaines technologies peut rendre la gestion du focus trop complexe ou trop instable pour ne reposer que sur la tabulation, les touches de direction et la touche entrée. Dans ce cas, la mise à disposition de raccourcis clavier peut être la seule solution pour rendre le composant utilisable.</p> <p>Le critère ne peut être considéré comme conforme qu’à la condition que les raccourcis clavier utilisés soient correctement documentés, qu’ils soient fonctionnels et qu’ils respectent le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.10\">critère 12.10</a>.</p> "
    },
    {
      "title": "Accolés (étiquette et champ accolés)",
      "body": "<p>Il faut que l’étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion.</p> "
    },
    {
      "title": "Alternative (à script)",
      "body": "<p>Texte ou procédé associé au script via une technique appropriée et permettant de mettre à disposition une fonction ou un contenu similaire à celui proposé par script.</p> <p>Note : lorsqu’une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d’y accéder doit être fourni par le site lui-même. Il peut s’agir d’un lien ou d’un bouton permettant d’accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.</p> "
    },
    {
      "title": "Alternative courte et concise",
      "body": "<p>Les conditions de restitution d’une alternative textuelle via des technologies d’assistance (par exemple une loupe d’écran) nécessitent qu’elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l’alternative par les utilisateurs de plages braille ou de loupes d’écran notamment.</p> "
    },
    {
      "title": "Alternative textuelle (image)",
      "body": "<p>« Nom accessible » restitué par les technologies d’assistance pour les éléments graphiques de type :</p> <ul> <li>Image (balise <code>&lt;img&gt;</code> ou balise ouvrante possédant un attribut WAI-ARIA <code>role=&quot;img&quot;</code>) ;</li> <li>Zone d’image réactive (balise <code>&lt;area&gt;</code>) ;</li> <li>Bouton de type image (balise <code>&lt;input&gt;</code> avec l’attribut <code>type=&quot;image&quot;</code>) ;</li> <li>Image objet (balise <code>&lt;object type=&quot;image/…&quot;&gt;</code>) ;</li> <li>Image vectorielle (balise <code>&lt;svg&gt;</code>) ;</li> <li>Image bitmap (balise <code>&lt;canvas&gt;</code>) ;</li> <li>Image embarquée (balise <code>&lt;embed&gt;</code>).</li> </ul> <p>Dans le cas d’un élément graphique, le « nom accessible » est obtenu selon l’ordre suivant :</p> <ul> <li>Passage de texte associé via l’attribut WAI-ARIA <code>aria-labelledby</code> pour les balises : <ul> <li><code>&lt;img&gt;</code> ;</li> <li><code>&lt;input type=&quot;image&quot;&gt;</code> ;</li> <li><code>&lt;svg&gt;</code> ;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt;</code> ;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt;</code> ;</li> <li><code>&lt;canvas&gt;</code> ;</li> <li>balises possédant un attribut WAI-ARIA <code>role=&quot;img&quot;</code>.</li> </ul> </li> <li>Sinon, contenu de l’attribut WAI-ARIA <code>aria-label</code> pour les éléments : <ul> <li><code>&lt;img&gt;</code> ;</li> <li><code>&lt;area&gt;</code> ;</li> <li><code>&lt;input type=&quot;image&quot;&gt;</code> ;</li> <li><code>&lt;svg&gt;</code> ;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt;</code> ;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt;</code> ;</li> <li><code>&lt;canvas&gt;</code> ;</li> <li>balises ouvrantes possédant un attribut WAI-ARIA <code>role=&quot;img&quot;</code>.</li> </ul> </li> <li>Sinon, contenu de l’attribut <code>alt</code> pour les balises : <ul> <li><code>&lt;img&gt;</code> ;</li> <li><code>&lt;area&gt;</code> ;</li> <li><code>&lt;input type=&quot;image&quot;&gt;</code>.</li> </ul> </li> <li>Sinon, contenu de l’attribut <code>title</code> pour les balises : <ul> <li><code>&lt;img&gt;</code> ;</li> <li><code>&lt;input type=&quot;image&quot;&gt;</code> ;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt;</code> ;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt;</code>.</li> </ul> </li> </ul> <p>Cet ordre doit être utilisé pour déterminer ce qui constitue l’alternative textuelle.</p> <p>Néanmoins, en cas de support partiel de l’algorithme de calcul du « nom accessible », c’est la valeur réellement restituée par les technologies d’assistance utilisées dans l’environnement de test (ou « base de référence ») qu’il faudra considérer comme alternative textuelle.</p> <p>Par exemple :</p> <ul> <li>En cas de présence conjointe d’un attribut WAI-ARIA <code>aria-label</code> et d’un attribut WAI-ARIA <code>aria-labelledby</code> sur une balise <code>&lt;img&gt;</code>, c’est le passage de texte référencé par l’attribut WAI-ARIA <code>aria-labelledby</code> qui doit être considérée comme alternative textuelle si le contenu du passage de texte est réellement restitué par les technologies d’assistance utilisées dans l’environnement de test ;</li> <li>En cas de présence conjointe d’un attribut WAI-ARIA <code>aria-label</code> et d’un attribut <code>alt</code> sur une balise <code>&lt;img&gt;</code>, c’est le contenu de l’attribut WAI-ARIA <code>aria-label</code> qui doit être considéré comme alternative textuelle si le contenu de l’attribut WAI-ARIA <code>aria-label</code> est réellement restitué par les technologies d’assistance utilisées dans l’environnement de test.</li> </ul> <p>Référence : <a href=\"https://www.w3.org/TR/accname-1.1/\">Accessible name and description calculation</a>.</p> <p>RGAA considère trois types d’alternatives textuelles liées à la nature de l’image :</p> <ul> <li>Pour une image porteuse d’information, l’alternative textuelle apporte l’information nécessaire à la compréhension du contenu qu’elle véhicule ;</li> <li>Pour une image de décoration, aucune alternative textuelle ne doit être restituée ;</li> <li>Pour une image <a href=\"#captcha\">CAPTCHA</a> ou une <a href=\"#image-test\">image-test</a>, l’alternative textuelle décrit seulement la nature et la fonction de l’image. En effet, l’alternative textuelle ne peut apporter l’information véhiculée par l’image sans rendre la fonction associée inopérante.</li> </ul> <p>Note 1 : pour une image <a href=\"#captcha\">CAPTCHA</a> l’alternative peut être, par exemple : « Code de sécurité anti-spam » ou « code pour vérifier que vous êtes un humain » ou toute autre alternative permettant à l’utilisateur de comprendre la nature et la fonction de l’image.</p> <p>Note 2 : pour un groupe d’images, par exemple un système de vote constitué de plusieurs images d’étoile, il est fortement conseillé d’utiliser soit la première image du groupe pour donner une alternative cohérente au groupe d’image (voir la <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G196\">technique WCAG2.1 G196</a>), soit une balise conteneur pourvue d’un rôle WAI-ARIA <code>img</code> et d’une alternative textuelle. Dans le premier cas, les autres images du groupe sont considérées comme des images de décoration. Dans le second cas, toutes les images du groupe sont considérées comme des images de décoration.</p> <p>Note 3 : pour les image-lien, l’alternative doit permettre de comprendre la fonction et la destination du lien ; ce cas est traité dans la thématique liens.</p> <p>Note 4 : pour les images vectorielles (balise <code>&lt;svg&gt;</code>) l’alternative textuelle pourrait se trouver aussi présente dans une balise <code>&lt;text&gt;</code> que cette balise soit ou non visible, même si ce n’est pas le rôle dévolu à cet élément en SVG.</p> <p>Note 5 : l’utilisation de l’attribut <code>alt</code> étant la seule technique totalement supportée par les aides techniques il est recommandé de privilégier cette solution lors de la mise en œuvre d’une alternative à une balise <code>&lt;img&gt;</code>, <code>&lt;area&gt;</code> et <code>&lt;input type=&quot;image&quot;&gt;</code>.</p> <p>Note 6 : bien que l’attribut <code>title</code> soit considéré comme une possibilité d’alternative textuelle à une image, son usage peut poser problème, notamment du fait qu’une image avec un attribut <code>alt</code> absent ou vide est considérée comme une image pourvue d’un <code>rôle “présentation”</code> par WAI-ARIA : <a href=\"https://www.w3.org/TR/html-aam-1.0/#details-id-54\">https://www.w3.org/TR/html-aam-1.0/#details-id-54</a>.Il faut s’assurer que les assistances techniques présentes dans l’environnement de test retenu restituent correctement l’alternative proposée par l’attribut <code>title</code>.</p> "
    },
    {
      "title": "Ambigu pour tout le monde",
      "body": "<p>L’intention ne peut être déterminée à partir du lien et de toute l’information de la page web présentée à l’utilisateur en même temps que ce lien (c’est-à-dire qu’un lecteur sans limitation fonctionnelle ne connaîtrait pas la fonction d’un lien avant de l’activer). Exemple : le mot « goyave » dans la phrase suivante utilisé comme lien : « L’une des exportations importantes est la goyave ». Ce lien pourrait conduire à une définition de la goyave, à un graphe présentant une liste des quantités de goyaves exportées ou à une photo de personnes récoltant la goyave. Jusqu’à ce que le lien soit activé, tout utilisateur est dans l’incertitude et une personne handicapée n’est donc pas désavantagée.</p> "
    },
    {
      "title": "Audiodescription synchronisée (média temporel)",
      "body": "<p>Narration ajoutée (via un fichier son) à une piste sonore pour décrire les détails visuels importants qui ne peuvent être compris à partir de la piste sonore principale seulement. L’audiodescription doit être synchronisée avec le média temporel par un dispositif applicatif lié au lecteur lui-même ou fourni par le développement par exemple avec JavaScript.</p> <p>Note 1 : l’audiodescription d’une vidéo fournit de l’information à propos des actions, des personnages, des changements de scènes, du texte apparaissant à l’écran et d’autres contenus visuels.</p> <p>Note 2 : dans une audiodescription standard, la narration est ajoutée durant les pauses qui existent dans le dialogue. (Voir aussi audiodescription étendue.)</p> <p>Note 3 : lorsque toute l’information de la vidéo est déjà donnée dans la piste audio, aucune audiodescription supplémentaire n’est requise.</p> "
    },
    {
      "title": "Bouton (formulaire)",
      "body": "<p>Élément d’un formulaire qui permet d’effectuer une action prédéfinie. Par exemple, le bouton de soumission d’un formulaire permet l’envoi au serveur des informations collectées pour leur traitement. L’intitulé d’un bouton doit décrire l’action qui résulte de son activation (par exemple : « Lancer votre recherche », « Envoyer votre message »).</p> <p>En HTML, il y a trois types de boutons de formulaire :</p> <ul> <li>Balise <code>&lt;input&gt;</code> de type <code>submit</code>, <code>reset</code> ou <code>button</code> ;</li> <li>Balise <code>&lt;input&gt;</code> de type <code>image</code> ;</li> <li>Balise <code>&lt;button&gt;</code>.</li> </ul> <p>Il est également possible de restituer un bouton à l’aide du rôle WAI-ARIA <code>button</code>.</p> <p>L’intitulé du bouton peut être de six types :</p> <ul> <li>Le contenu du passage de texte associé au bouton via l’attribut WAI-ARIA <code>aria-labelledby</code> lorsqu’il est présent ;</li> <li>Le contenu de l’attribut <code>aria-label</code> lorsqu’il est présent ;</li> <li>Le contenu de l’attribut <code>alt</code> d’un bouton de type <code>image</code> ;</li> <li>Le contenu de l’attribut <code>value</code> des boutons de type <code>submit</code>, <code>reset</code> ou <code>button</code> ;</li> <li>Le contenu de la balise <code>&lt;button&gt;</code> ;</li> <li>Le contenu de l’attribut <code>title</code> lorsqu’il est présent.</li> </ul> <p>Note importante : lorsque plusieurs de ces techniques sont présentes sur un même bouton, le calcul du « nom accessible », c’est-à-dire ce qui sera restitué, obéit à un ordre strict :</p> <ul> <li><code>aria-labelledby</code> ;</li> <li>Sinon <code>aria-label</code> ;</li> <li>Sinon <code>alt</code> pour le cas des input <code>image</code> ;</li> <li>Sinon <code>value</code> pour le cas des input <code>submit</code>, <code>reset</code> ou <code>button</code> ;</li> <li>Sinon contenu de la balise <code>&lt;button&gt;</code> ;</li> <li>Sinon <code>title</code>.</li> </ul> <p>Cet ordre doit être utilisé pour l’évaluation de la pertinence du « nom accessible » du bouton. Par exemple, même dans le cas de la présence d’un <code>title</code> et d’un passage de texte référencé par <code>aria-labelledby</code> sur le même bouton, c’est le passage de texte référencé par <code>aria-labelledby</code> qui doit être évalué.</p> <p>Référence : <a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible name and description calculation</a>.</p> <p>Par ailleurs, un « nom accessible » sera considéré comme non-pertinent s’il ne reprend pas le texte visible du bouton. Par exemple : <code>&lt;button aria-label=&quot;confirmer la saisie&quot;&gt;valider la saisie&lt;/button&gt;</code> sera considéré comme non conforme au <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#11.9\">critère 11.9</a>.</p> "
    },
    {
      "title": "Cadre",
      "body": "<p>Cadre : élément HTML (balise <code>&lt;frame&gt;</code>) permettant d’afficher un contenu dans la page web dans laquelle il est implémenté.</p> <p>Cadre en ligne : élément HTML (balise <code>&lt;iframe&gt;</code>) permettant d’afficher un contenu dans la page web dans laquelle il est implémenté.</p> "
    },
    {
      "title": "CAPTCHA",
      "body": "<p>Un CAPTCHA est un test utilisé pour distinguer un utilisateur humain d’un ordinateur. Le test utilise souvent des images contenant du texte déformé, mélangé avec d’autres formes ou utilisant des jeux de couleur altérées, que l’utilisateur est invité à retaper. D’autres formes de CAPTCHA peuvent être basées sur des questions logiques ou des extraits sonores.</p> "
    },
    {
      "title": "Champ de saisie de formulaire",
      "body": "<p>Objet d’un formulaire permettant à l’utilisateur :</p> <ul> <li>De saisir des données textuelles ou préformatées : <ul> <li><code>input type=&quot;text&quot;</code> ;</li> <li><code>input type=&quot;password&quot;</code> ;</li> <li><code>input type=&quot;search&quot;</code> ;</li> <li><code>input type=&quot;email&quot;</code> ;</li> <li><code>input type=&quot;number&quot;</code> ;</li> <li><code>input type=&quot;tel&quot;</code> ;</li> <li><code>input type=&quot;url&quot;</code> ;</li> <li><code>textarea</code>.</li> </ul> </li> <li>De sélectionner des valeurs prédéfinies : <ul> <li><code>input type=&quot;checkbox&quot;</code> ;</li> <li><code>input type=&quot;radio&quot;</code> ;</li> <li><code>input type=&quot;date&quot;</code> ;</li> <li><code>input type=&quot;range&quot;</code> ;</li> <li><code>input type=&quot;color&quot;</code> ;</li> <li><code>input type=&quot;time&quot;</code> ;</li> <li><code>input type=&quot;month&quot;</code> ;</li> <li><code>input type=&quot;week&quot;</code> ;</li> <li><code>input type=&quot;datetime-local&quot;</code> ;</li> <li><code>select</code> ;</li> <li><code>datalist</code> ;</li> <li><code>optgroup</code> ;</li> <li><code>option</code>.</li> </ul> </li> <li>De télécharger des fichiers : <ul> <li><code>input type=&quot;file&quot;</code>.</li> </ul> </li> <li>Ou d’afficher des résultats : <ul> <li><code>output</code> ;</li> <li><code>progress</code> ;</li> <li><code>meter</code>.</li> </ul> </li> <li>Les balises possédant un rôle WAI-ARIA permettant de restituer un champ de formulaire sont également couvertes par cette définition : <ul> <li><code>progressbar</code> ;</li> <li><code>slider</code> ;</li> <li><code>spinbutton</code> ;</li> <li><code>textbox</code> ;</li> <li><code>listbox</code> ;</li> <li><code>searchbox</code> ;</li> <li><code>combobox</code> ;</li> <li><code>option</code> ;</li> <li><code>checkbox</code> ;</li> <li><code>radio</code> ;</li> <li><code>switch</code>.</li> </ul> </li> <li>Les objets de formulaires et rôle WAI-ARIA suivants ne sont pas considérés comme des champs de formulaires : <ul> <li><code>input type=&quot;submit&quot;</code> ;</li> <li><code>input type=&quot;reset&quot;</code> ;</li> <li><code>input type=&quot;hidden&quot;</code> ;</li> <li><code>input type=&quot;image&quot;</code> ;</li> <li><code>input type=&quot;button&quot;</code> ;</li> <li><code>button</code> ;</li> <li>attribut WAI-ARIA <code>role=&quot;button&quot;</code>.</li> </ul> </li> </ul> "
    },
    {
      "title": "Champs de même nature",
      "body": "<p>Dans un formulaire, ensemble des champs pouvant être regroupés par la nature des informations attendues. Le regroupement vise à identifier les champs devant être traités comme un ensemble.</p> <p>Quelques exemples :</p> <ul> <li>Trois champs successifs pour saisir une date (jour/mois/année) ;</li> <li>Champs successifs pour un numéro de téléphone ;</li> <li>Un bloc destiné à saisir l’identité et l’adresse de l’utilisateur, lorsque le formulaire contient plusieurs blocs de contact ;</li> <li>Un ensemble de boutons radio ou de cases à cocher qui se rapportent à une question.</li> </ul> <p>Ces champs doivent être regroupés lorsque les intitulés de label ne sont pas suffisants pour informer l’utilisateur que les champs font partie d’un regroupement.</p> "
    },
    {
      "title": "Changement brusque de luminosité ou effet de flash",
      "body": "<p>Alternance de luminance relative qui peut causer des crises chez certaines personnes si leur taille est suffisamment importante dans une gamme de fréquences spécifiques.</p> "
    },
    {
      "title": "Changement de contexte",
      "body": "<p>Changements majeurs dans le contenu d’une page web qui, s’ils sont faits sans que l’utilisateur n’en soit conscient, peuvent désorienter l’utilisateur qui ne peut voir l’ensemble de la page en même temps. Les changements de contexte comprennent les changements :</p> <ul> <li>d’agent utilisateur ;</li> <li>d’espace de restitution ;</li> <li>de focus ;</li> <li>de contenu qui modifie la signification de la page web.</li> </ul> <p>Note : Un changement de contenu n’est pas toujours un changement de contexte. Un changement dans le contenu comme le déploiement d’une arborescence, un menu dynamique ou un déplacement de tabulation ne change pas nécessairement le contexte à moins qu’il ne change aussi l’un des éléments énumérés ci-dessus (le focus, par exemple).</p> <p>Par exemple, l’ouverture d’une nouvelle fenêtre, le déplacement du focus sur un composant différent, le déplacement vers une nouvelle page (y compris tout ce qui, pour l’utilisateur, aurait l’air d’un déplacement vers une autre page) ou la réorganisation significative du contenu d’une page sont autant d’illustrations d’un changement de contexte.</p> "
    },
    {
      "title": "Changement de langue",
      "body": "<p>L’indication des changements de langue est nécessaire pour indiquer aux technologies d’assistance de modifier la restitution vocale d’un élément. Les changements de langue concernent tous les contenus, y compris les valeurs de certains attributs comme <code>title</code>.</p> <p>Note : il n’est pas possible d’indiquer des changements de langue dans une valeur d’attribut elle-même, dans ce cas le changement de langue est indiqué sur l’élément qui contient l’attribut. Par exemple un lien affecté d’un <code>title</code> en anglais devra comporter un attribut <code>lang=&quot;en&quot;</code>. Lorsque l’attribut contient plusieurs passages de texte dans des langues différentes, le critère est non applicable.</p> "
    },
    {
      "title": "Code de langue",
      "body": "<p>Code de 2 caractères (ISO 639-1) ou 3 caractères (ISO 639-2 et suivants) permettant d’indiquer la langue d’un document ou d’un passage de texte. L’indication du code de langue est constituée de deux parties séparées par un tiret sur le modèle <code>lang=&quot;[code]-[option]&quot;</code>.</p> <ul> <li>[code] représente un code de langue valide sur 2 ou 3 caractères ;</li> <li>[option] est une indication laissée à l’appréciation de l’auteur.</li> </ul> <p>Lorsqu’un code de pays est utilisé comme option, il peut servir à indiquer une régionalisation de la langue, l’indication “en-us” indique la langue américaine, par exemple. L’indication du code de langue ne concerne que la partie [code] avant le tiret.</p> "
    },
    {
      "title": "Compatible avec les technologies d’assistance",
      "body": "<p>Un contenu ou une fonctionnalité doit être compatible avec les technologies d’assistance des utilisateurs ainsi qu’avec les fonctions d’accessibilité des navigateurs et des autres agents utilisateurs via une API d’accessibilité.</p> <p>Cela concerne, à la fois, la technologie, ses fonctionnalités et ses usages :</p> <ul> <li>La façon dont la technologie Web est utilisée doit être compatible avec les technologies d’assistance des utilisateurs. Cela signifie que la façon dont la technologie est utilisée a été testée dans une perspective d’interopérabilité avec des utilisateurs des technologies d’assistance dans la ou les langues du contenu ;</li> <li>La technologie fonctionne de façon native dans des agents utilisateurs largement distribués qui sont, eux-mêmes, compatibles avec l’accessibilité (comme HTML et CSS) ou avec un module d’extension largement distribué qui est, lui-même, compatible avec l’accessibilité.</li> </ul> <p>La vérification de la compatibilité avec les technologies d’assistance nécessite de réaliser un certain nombre de tests spécifiques à la technologie utilisée, par exemple :</p> <ul> <li>Vérifier le nom, le rôle, le paramétrage et les changements d’états des composants d’interface ;</li> <li>Vérifier que la restitution d’un composant d’interface est correcte pour la ou les technologies d’assistance utilisées.</li> </ul> "
    },
    {
      "title": "Composant d’interface",
      "body": "<p>Un composant d’interface est un élément avec lequel l’utilisateur peut interagir, par exemple un bouton, un lien, une zone de saisie. Certains composants peuvent être plus complexes comme un menu, une fenêtre de dialogue, un système d’onglets. Enfin, un composant d’interface peut être basé sur des éléments natifs de HTML ou développés de toutes pièces en JavaScript et des attributs WAI-ARIA. En particulier pour les éléments ayant des attributs WAI-ARIA correspondant à un <a href=\"#motif-de-conception\">motif de conception</a> il est recommandé de considérer le document <span lang=\"en\"><a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a></span> lors de leur implémentation.</p> "
    },
    {
      "title": "Compréhensible (ordre de lecture)",
      "body": "<p>Un contenu compréhensible est lisible (l’ordre des éléments est logique) et cohérent (l’enchaînement de la lecture est cohérent).</p> "
    },
    {
      "title": "Contenu alternatif",
      "body": "<p>Contenu venant se substituer à un autre apportant la même information mais pouvant être présenté de façon différente. Ce contenu peut être de forme textuelle mais également être lui-même structuré à l’aide de balises. Un contenu alternatif devra respecter l’ensemble des critères du RGAA qui lui sont applicables pour être considéré comme une alternative accessible à l’élément qu’il remplace. Exemple : un tableau de données peut être le contenu alternatif d’une image bitmap (balise <code>&lt;canvas&gt;</code>) affichant un graphique statistique.</p> "
    },
    {
      "title": "Contenu caché",
      "body": "<p>Les technologies d’assistance (notamment les lecteurs d’écran) ne restituent pas le contenu masqué via les propriétés :</p> <ul> <li><code>display</code> avec la valeur <code>none</code> (<code>display: none</code>) ;</li> <li><code>visibility</code> avec la valeur <code>hidden</code> (<code>visibility: hidden</code>) ;</li> <li><code>font-size</code> avec la valeur <code>0</code> (<code>font-size:0</code>) ;</li> <li>Attribut HTML5 <code>hidden</code> ;</li> <li>Attribut WAI-ARIA <code>aria-hidden=&quot;true&quot;</code>.</li> </ul> <p>Tous les contenus utilisant une ou plusieurs de ces propriétés et attributs sont applicables pour le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#10.8\">critère 10.8</a>.</p> "
    },
    {
      "title": "Contenu visible",
      "body": "<p>Pour le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2.1\">test 12.2.1</a> : « Contenu présent » signifie que le contenu visible reste présent lorsque CSS est désactivé. Par exemple, une image porteuse d’information en propriété de fond CSS invalide ce test car l’information n’est plus « présente » lorsque CSS est désactivé. En revanche, une image porteuse d’information en propriété de fond CSS mais accompagnée d’un texte caché valide ce test car l’information est bien « présente » lorsque CSS est désactivé.</p> <p>Note : la pratique qui consiste à gérer des images en propriété de fond d’éléments via CSS est formellement déconseillée, même si elle est accompagnée d’un texte caché.</p> "
    },
    {
      "title": "Contexte du lien",
      "body": "<p>Le contexte du lien représente les informations supplémentaires (on parle d’informations de contexte) qui peuvent être mises en relation par un programme informatique avec l’<a href=\"#intitule-ou-nom-accessible-de-lien\">intitulé du lien</a>. Les informations de contexte qui permettent de compléter l’<a href=\"#intitule-ou-nom-accessible-de-lien\">intitulé du lien</a> sont les suivantes :</p> <ul> <li>Le contenu de la phrase dans laquelle le lien texte est présent ;</li> <li>Le contenu du paragraphe (balise <code>&lt;p&gt;</code>) dans lequel le lien texte est présent ;</li> <li>Le contenu de l’item de liste (balise <code>&lt;li&gt;</code>) ou le contenu d’un item de liste parent (balise <code>&lt;li&gt;</code>) dans lequel le lien texte est présent ;</li> <li>Le contenu du titre (balise <code>&lt;hx&gt;</code>) précédent le lien texte ;</li> <li>Le contenu de la ou les cellule(s) d’en-tête de tableau (balise(s) <code>&lt;th&gt;</code>) associée(s) à la cellule de donnée (balise <code>&lt;td&gt;</code>) dans laquelle le lien texte est présent ;</li> <li>Le contenu de la cellule de donnée (balise <code>&lt;td&gt;</code>) dans laquelle le lien texte est présent.</li> </ul> <p>Note 1 : l’un des 6 contextes de lien combiné à l’<a href=\"#intitule-ou-nom-accessible-de-lien\">intitulé du lien</a> doit permettre de comprendre la fonction et la destination du lien.</p> <p>Note 2 : RGAA considère qu’une adresse e-mail de type <code>xxx@xxx.yyy</code> est un texte de lien suffisant pour comprendre la fonction du lien et ne requiert pas de signaler plus explicitement l’action.</p> "
    },
    {
      "title": "Contraste",
      "body": "<p>Opposition marquée entre la luminosité d’une couleur de premier plan et d’une couleur d’arrière-plan. Le rapport de contraste est basé sur la différence de luminance relative entre l’arrière-plan et le premier plan selon la règle : (L1 + 0,05) / (L2 + 0,05) où L1 est la luminance relative la plus claire et L2 la luminance relative la plus sombre. La luminosité est calculée selon la formule suivante : L = 0,2126 _ R + 0,7152 _ G + 0,0722 * B. Où R, G et B sont définis par :</p> <ul> <li>Si R sRGB ⩽ 0,03928 alors R = R sRGB /12,92 sinon R = ((R sRGB +0,055)/1,055) ^ 2,4 ;</li> <li>Si G sRGB ⩽ 0,03928 alors G = G sRGB /12,92 sinon G = ((G sRGB +0,055)/1,055) ^ 2,4 ;</li> <li>Si B sRGB ⩽ 0,03928 alors B = B sRGB /12.92 sinon B = ((B sRGB +0,055)/1,055) ^ 2,4.</li> </ul> <p>et R sRGB, G sRGB et B sRGB sont définis par :</p> <ul> <li>R sRGB = R8bit/255 ;</li> <li>G sRGB = G8bit/255 ;</li> <li>B sRGB = B8bit/255.</li> </ul> <p>Le caractère « ^ » est l’opérateur de puissance.</p> <p>Note : la mesure de contraste concerne le texte, le texte en image, le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos. Pour le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos, la taille de la police doit être mesurée par rapport à la taille d’affichage par défaut (telle qu’affichée). Les textes présents dans les éléments d’une image ou d’une vidéo (par exemple un écriteau, une affiche…) ne sont pas concernés.</p> <p>Source (en anglais) : <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G18#procedure\">Procédure de calcul de contraste des WCAG</a>.</p> "
    },
    {
      "title": "Contrôle (contenu en mouvement ou clignotant)",
      "body": "<p>Possibilité pour l’utilisateur de contrôler l’affichage ou la lecture d’un contenu en mouvement ou clignotant par le clavier et la souris, au moins.</p> <p>Tous les contenus en mouvement, à l’exception des médias temporels pris en charge par la thématique multimédia, sont concernés : les images animées (par exemple un gif animé), les contenus en mouvement proposés via une balise <code>&lt;object&gt;</code>, du code JavaScript ou des effets CSS par exemple.</p> <p>Note 1 : lorsque c’est approprié, la méthode de contrôle devrait être disponible comme premier élément de la page.</p> <p>Note 2 : la méthode de contrôle du contenu en mouvement ou clignotant doit permettre à l’utilisateur d’interagir avec le reste de la page. En conséquence, l’arrêt ou la mise en pause via un événement déclenché uniquement sur la prise de focus ne permet pas de valider le critère.</p> <p>Note 3 : Dans certains cas, le mouvement fait partie intégrante du composant et il n’est pas possible d’en donner le contrôle à l’utilisateur, par exemple une barre de progression dont la fonction est d’indiquer par un mouvement la progression d’un évènement comme un téléchargement. Dans ce cas le critère est Non Applicable.</p> "
    },
    {
      "title": "Contrôle de la consultation (d’un média temporel)",
      "body": "<p>Possibilité pour l’utilisateur de contrôler la consultation d’un média temporel par le clavier et tout dispositif de pointage, au moins. Les points suivants doivent être respectés :</p> <ul> <li>Liste des fonctionnalités obligatoires de contrôle de la consultation : <ul> <li>L’objet multimédia doit toujours avoir les fonctionnalités suivantes, au minimum : lecture, pause ou stop ;</li> <li>Si l’objet multimédia a du son, il doit avoir une fonctionnalité d’activation / désactivation du son ;</li> <li>Si l’objet multimédia a une audiodescription, il doit avoir une fonctionnalité de contrôle de l’apparition / disparition de l’audiodescription.</li> </ul> </li> <li>Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins.</li> <li>Chaque fonctionnalité doit être activable par le clavier et par tout dispositif de pointage, au moins.</li> </ul> <p>Note : s’il n’y a pas de son à un média temporel, il n’est pas utile de mettre une fonctionnalité d’activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu’elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l’utilisateur est susceptible d’y accéder et de vouloir l’activer.</p> "
    },
    {
      "title": "Contrôle de saisie (formulaire)",
      "body": "<p>Ensemble des processus qui permettent de prévenir l’utilisateur des champs obligatoires, des indications de type ou de format attendus et des erreurs de saisie dans un formulaire. Ces contrôles de saisie peuvent être implémentés par l’auteur des contenus ou s’appuyer sur des attributs (comme <code>required</code> ou <code>pattern</code>), des attributs WAI-ARIA (comme <code>aria-required</code>) ou des types de champ qui produisent de manière automatique des indications de saisie ou d’erreurs (comme les types <code>url</code>, <code>email</code>, <code>date</code>, <code>time</code> par exemple).</p> "
    },
    {
      "title": "Contrôle (son déclenché automatiquement)",
      "body": "<p>Possibilité pour l’utilisateur d’arrêter ou de relancer un son déclenché automatiquement.</p> <p>Note : la méthode de contrôle du son devrait être disponible comme premier élément de la page.</p> "
    },
    {
      "title": "Correctement restitué (par les technologies d’assistance)",
      "body": "<p>Lorsqu’un critère, un test ou une condition de test demande de vérifier la restitution d’un dispositif, il faut s’assurer que ladite restitution est compatible avec l’accessibilité.</p> <p>Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l’environnement de test (ou « base de référence ») utilisé pour déclarer qu’un élément, un dispositif ou une alternative est « compatible avec l’accessibilité ».</p> <p>Par exemple : le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#1.3.8\">test 1.3.8</a> demande de vérifier que l’alternative d’une image bitmap (balise <code>&lt;canvas&gt;</code>) porteuse d’information est correctement restituée.</p> <p>On procède alors à un test avec les outils de l’environnement de test défini pour le site.</p> <p>Si on constate que l’alternative est correctement restituée, le test est validé.</p> "
    },
    {
      "title": "Couleur d’arrière-plan contiguë et couleur contiguë",
      "body": "<p>Couleur d’arrière-plan contiguë : couleur d’arrière-plan directement en contact avec le bord extérieur du composant d’interface ou de l’<a href=\"#element-graphique\">élément graphique</a>.</p> <p>Exemples :</p> <ul> <li>Pour un bouton blanc avec une bordure bleue sur un fond blanc, le fond blanc à l’extérieur de la bordure bleue correspond à la couleur d’arrière-plan contiguë ;</li> <li>Pour un bouton rouge sur fond blanc, le fond blanc à l’extérieur du rouge correspond à la couleur d’arrière-plan contiguë ;</li> <li>Pour un bouton blanc avec une bordure verte qui devient noire à la prise de focus et au survol, le fond blanc à l’extérieur de la bordure verte de l’état par défaut et de la bordure noire de l’état au survol et au focus correspond à la couleur d’arrière-plan contiguë.</li> </ul> <p>Couleur contiguë : couleur directement en contact avec une autre couleur. Exemple dans un panneau de « sens interdit » le rouge du panneau est la couleur contiguë au trait blanc au centre du panneau.</p> <p>Note 1 : dans le cas de la présence d’un dégradé, c’est la couleur contiguë la moins contrastée du dégradé qui sera à considérer comme la couleur contiguë ou couleur d’arrière-plan contiguë.</p> <p>Note 2 : dans le cas de la présence de plusieurs couleurs, c’est l’ensemble des couleurs qui seront à considérer comme couleur contiguë ou couleur d’arrière-plan contiguë.</p> "
    },
    {
      "title": "Description détaillée (image)",
      "body": "<p>Contenu associé à une image en complément de son alternative textuelle afin de décrire en totalité l’information véhiculée par l’image. La description détaillée peut être associée à l’image via :</p> <ul> <li>Un attribut <code>longdesc</code> qui contient l’adresse d’une page ou d’un emplacement dans la page contenant la description détaillée ;</li> <li>Une référence à une description détaillée adjacente à l’image dans l’alternative textuelle ;</li> <li>Un <a href=\"#lien-ou-bouton-adjacent\">lien ou un bouton adjacent</a> qui permet d’accéder à la description détaillée dans la page ou dans une autre page ;</li> <li>Un ou plusieurs passages de texte identifiés par un id et liés par un attribut WAI-ARIA <code>aria-describedby</code> sur le modèle <code>aria-describedby=&quot;ID1 ID2 ID3…&quot;</code>.</li> </ul> <p>Note 1 : Si le support de l’attribut <code>aria-describedby</code> fait défaut, il est possible d’utiliser un ou plusieurs passages de texte identifiés par un <code>id</code> et liés par un attribut WAI-ARIA <code>aria-labelledby</code> à la suite de l’alternative textuelle.</p> <p>Note 2 : Pour assurer une compatibilité maximum avec les agents utilisateurs, notamment Internet Explorer 11, il est recommandé d’implémenter un <code>tabindex=&quot;-1&quot;</code> sur les balises qui contiennent un passage de texte et qui ne sont pas des éléments interactifs (bouton, liens, éléments de formulaires, etc.).</p> "
    },
    {
      "title": "Élément graphique",
      "body": "<p>Élément faisant appel à une représentation visuelle telle que des images, des pictogrammes ou des graphiques.</p> <p>Cet élément peut être composé d’une ou plusieurs parties dont la visibilité est nécessaire à sa compréhension (par exemple chaque point sur chaque ligne d’un graphique de statistiques).</p> "
    },
    {
      "title": "En-tête de colonne ou de ligne",
      "body": "<p>Contenu d’une cellule dans un tableau de données (la première cellule d’une colonne ou d’une ligne, généralement) qui sert d’intitulé pour la totalité ou une partie des cellules de la colonne ou de la ligne. Une colonne ou une ligne peut contenir plusieurs en-têtes (en-tête intermédiaire). Lorsque les en-têtes s’appliquent à l’ensemble d’une ligne ou d’une colonne, ils peuvent être structurés avec une balise <code>&lt;th&gt;</code> ou une balise pourvue d’un attribut WAI-ARIA <code>role=&quot;rowheader&quot;</code> ou <code>role=&quot;columnheader&quot;</code>. Dans le cas contraire, seule une balise <code>&lt;th&gt;</code> peut être utilisée.</p> <p>Note : seule la balise <code>&lt;th&gt;</code> étant totalement supportée par l’ensemble des technologies d’assistance, il est fortement recommandé de privilégier cette solution lors de la mise en œuvre afin d’éviter de nombreuses vérifications dans les différentes combinaisons prévues dans l’environnement de test (ou « base de référence »).</p> "
    },
    {
      "title": "Ensemble de pages",
      "body": "<p>Pages web liées les unes aux autres par des liens et constituant un ensemble cohérent à l’intérieur d’un site web. Par exemple, les pages d’une rubrique spécifique, les pages d’un blog, les pages d’administration d’un compte client sont autant d’ensembles de page.</p> <p>Note : la page d’accueil d’un site web peut constituer, à elle seule, un « ensemble de pages » du fait de son unicité.</p> "
    },
    {
      "title": "Environnement maîtrisé",
      "body": "<p>Tout environnement dans lequel l’accès à l’information, les technologies, les conditions d’utilisation et le profil des utilisateurs peuvent être connus et maîtrisés. Les principaux éléments dont la maîtrise est essentielle sont :</p> <ul> <li>Le type et la version des navigateurs ;</li> <li>Les technologies supportées, leur version et leur activation (JavaScript, WAI-ARIA, Flash, Silverlight…) ;</li> <li>Les technologies d’assistance et tout dispositif utilisé de manière spécifique par les utilisateurs handicapés ;</li> <li>Les systèmes d’exploitation et les APIs d’accessibilité supportées ;</li> <li>La formation des utilisateurs de technologies d’assistance à l’utilisation de tout dispositif particulier (interface, application en ligne…).</li> </ul> <p>Les auteurs et les administrateurs doivent garantir la compatibilité des technologies utilisées et de leurs usages par les utilisateurs et leurs technologies (y compris les technologies d’assistance). Les services d’information ou les sites Web, quel que soit leur statut, qui offrent un accès public ne peuvent pas être considérés comme des environnements maîtrisés.</p> "
    },
    {
      "title": "Étiquette de champ de formulaire",
      "body": "<p>Texte à proximité du champ de formulaire permettant d’en connaître la nature, le type ou le format des informations attendues. L’étiquette peut être associée au champ de formulaire de plusieurs manières :</p> <ul> <li>Par l’utilisation d’une balise <code>&lt;label&gt;</code> ;</li> <li>Par l’utilisation de l’attribut WAI-ARIA <code>aria-label</code> ;</li> <li>Par l’utilisation d’une liaison entre le texte et le champ par l’attribut WAI-ARIA <code>aria-labelledby</code> ;</li> <li>Par l’utilisation de l’attribut <code>title</code>.</li> </ul> <p>Note importante : lorsque plusieurs de ces techniques sont présentes sur un même champ, le calcul du « nom accessible », c’est-à-dire ce qui sera restitué, obéit à un ordre strict :</p> <ul> <li><code>aria-labelledby</code> ;</li> <li>Sinon <code>aria-label</code> ;</li> <li>Sinon <code>&lt;label&gt;</code> ;</li> <li>Sinon <code>title</code>.</li> </ul> <p>Cet ordre doit être utilisé pour l’évaluation de la pertinence de l’étiquette (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#11.2\">critère 11.2</a>). Par exemple, même dans le cas de la présence d’un <code>&lt;label&gt;</code>, c’est le passage de texte référencé par <code>aria-labelledby</code> qui doit être pris en compte.</p> <p>Référence : <span lang=\"en\"><a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible name and description calculation</a></span>.</p> <p>Note importante au sujet de l’utilisation de <code>placeholder</code> : lorsque l’attribut <code>placeholder</code> est présent, il est susceptible d’être restitué à la place de l’attribut <code>title</code>. Par conséquent, lorsque ces deux attributs <code>title</code> et <code>placeholder</code> sont présents, ils doivent être identiques.</p> <p>Note au sujet des étiquettes liées par <code>aria-labelledby</code> : Il s’agit d’un ou de plusieurs passages de texte identifiés par des <code>id</code> et liés par <code>aria-labelledby</code> sur le modèle suivant : <code>aria-labelledby=&quot;ID1 ID2 ID3…&quot;</code>. Pour assurer une compatibilité maximum avec les agents utilisateurs, notamment Internet Explorer 11, il est recommandé d’implémenter un <code>tabindex=&quot;-1&quot;</code> sur les passages de textes qui ne sont pas des éléments interactifs (bouton, liens, éléments de formulaires, etc.).</p> <p>Note : l’attribut <code>aria-label</code> ne peut pas être utilisé pour indiquer le caractère obligatoire d’un champ.</p> "
    },
    {
      "title": "Étiquettes cohérentes",
      "body": "<p>Les étiquettes de champs de formulaire présentes dans une même page ou dans un ensemble de pages et réclamant la saisie d’une même information doivent être formulées sans ambiguïté pour que l’utilisateur sache que l’information qu’il doit communiquer est la même.</p> "
    },
    {
      "title": "Feuille de style",
      "body": "<p>Le langage CSS destiné à la mise en forme des éléments du contenu (exemples : couleur du fond de la page, taille / police / couleur des caractères, positionnement de l’information dans la page web…). Les styles CSS peuvent être externes (fichier CSS), embarqués (déclarés dans l’en-tête de la page) ou en ligne (déclarés via l’attribut <code>style</code> d’une balise).</p> "
    },
    {
      "title": "Formulaire",
      "body": "<p>Balise <code>&lt;form&gt;</code> ou balise possédant un attribut WAI-ARIA <code>role=&quot;form&quot;</code>.</p> "
    },
    {
      "title": "Gestes complexes et gestes simples",
      "body": "<p>Un geste simple implique un contact en un point unique de l’écran. Il peut s’agir d’une pression ou d’un clic simple, d’une double-pression ou d’un double-clic, d’une pression prolongée.</p> <p>Un geste complexe peut être à la fois un geste impliquant plusieurs points de contact sur l’écran (exemple : un geste avec deux doigts sur l’écran pour zoomer ou dézoomer une carte) et un geste basé sur le suivi d’une trajectoire sur l’écran (exemple : fonction JavaScript permettant de détection le déplacement d’un doigt vers la gauche ou droite sur une surface tactile pour déclencher le passage à l’item précédent / suivant d’un carrousel).</p> "
    },
    {
      "title": "Image de décoration",
      "body": "<p>Image n’ayant aucune fonction et ne véhiculant aucune information particulière par rapport au contenu auquel elle est associée.</p> <p>Exemples :</p> <ul> <li>Une image précédant chaque item d’une liste ;</li> <li>Une image servant à caler la mise en page ;</li> <li>Une image de coin arrondie pour habiller un bloc d’information ;</li> <li>Une image d’illustration n’apportant aucune information nécessaire à la compréhension du texte auquel elle est associée.</li> </ul> <p>Note : les balises possédant un attribut WAI-ARIA <code>role=&quot;img&quot;</code> ne peuvent faire office d’image de décoration qu’à la condition qu’elles possèdent un attribut WAI-ARIA <code>aria-hidden=&quot;true&quot;</code>.</p> "
    },
    {
      "title": "Image objet",
      "body": "<p>Image incorporée ou générée par une balise <code>&lt;object&gt;</code>.</p> "
    },
    {
      "title": "Image porteuse d’information",
      "body": "<p>Image qui véhicule une information nécessaire à la compréhension du contenu auquel elle est associée.</p> <p>Note 1 : lorsque l’image est le seul contenu d’un lien, son alternative est l’intitulé du lien. Dans ce cas, l’alternative de l’image devrait être évaluée avec la thématique « Liens ».</p> <p>Note 2 : lorsqu’un bouton de formulaire, inséré avec l’élément <code>&lt;button&gt;</code>, ne contient qu’une image (balise <code>&lt;img&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, <code>&lt;canvas&gt;</code> ou <code>&lt;svg&gt;</code>), l’alternative de l’image est l’intitulé du bouton. Deux cas peuvent se présenter :</p> <ul> <li>Le bouton est contrôlé par son type, par exemple, le type <code>submit</code> ou <code>reset</code>, et fait partie d’un formulaire. Dans ce cas, le bouton image doit être évalué avec la thématique « Formulaires » ;</li> <li>Le bouton est contrôlé par un dispositif JavaScript. Dans ce cas, le bouton image doit être évalué avec la thématique « Scripts ».</li> </ul> "
    },
    {
      "title": "Image réactive",
      "body": "<ul> <li>Image réactive côté client (attribut <code>usemap</code>) : image divisée en zones cliquables ou neutres (attribut <code>nohref</code>) ;</li> <li>Image réactive côté serveur (attribut <code>ismap</code>) : image pour laquelle le navigateur transmet au serveur les coordonnées du pointeur, chaque jeu de coordonnées correspondant à une ressource (page web). L’image réactive côté serveur est extrêmement rare.</li> </ul> <p>Note : en HTML5, l’attribut <code>ismap</code> est obsolète et non conforme pour les boutons de type <code>image</code> (<code>input type=&quot;image&quot;</code>).</p> "
    },
    {
      "title": "Image-test",
      "body": "<p>Image servant dans un test, captcha ou une image servant de test dans un quiz ou un jeu.</p> <p>Exemple : une série d’images présente un détail issu de tableaux célèbres ; il faut reconnaître le titre et le peintre de chaque tableau. Dans cette situation, il n’est pas possible de donner une alternative pertinente (par exemple le nom du tableau et/ou du peintre) sans rendre le test inutilisable. L’alternative doit alors se contenter de donner la possibilité d’identifier l’image, par exemple “image 1 du test”.</p> "
    },
    {
      "title": "Image texte objet",
      "body": "<p>Image générée par la balise <code>&lt;object&gt;</code> et affichant du texte.</p> "
    },
    {
      "title": "Image texte",
      "body": "<p>Image affichant du texte.</p> <p>Note : il n’est pas recommandé d’utiliser des images-textes. Lorsqu’il est possible de reproduire les mêmes effets en CSS, le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#1.8\">critère 1.8</a> impose que le texte soit reproduit en texte CSS, ou qu’un mécanisme de remplacement permette à l’utilisateur de remplacer ces images par du <a href=\"#texte-style\">texte stylé</a> en CSS.</p> "
    },
    {
      "title": "Image véhiculant une information (donnée par la couleur)",
      "body": "<p>Image dont tout ou partie du contenu transmet visuellement une information par l’intermédiaire d’une couleur uniquement.</p> "
    },
    {
      "title": "Indication de champ obligatoire",
      "body": "<p>Indication textuelle ou graphique (icône) permettant à l’utilisateur de savoir que la saisie d’un champ est obligatoire préalablement à la saisie.</p> <p>Note : Dans le cas où cette indication n’est pas réalisée de manière textuelle explicite (icône, “*”, “!”, etc.), l’explication de la signification de cette indication doit se situer, visuellement et dans l’ordre du code source, avant la première utilisation de l’indication.</p> "
    },
    {
      "title": "Indication donnée par la forme, la taille ou la position",
      "body": "<p>Il peut s’agir, par exemple :</p> <ul> <li>De la présence d’un marqueur visuel, pour indiquer la page active dans un menu de navigation (indication donnée par la position) ;</li> <li>D’une mise en avant-plan pour indiquer un onglet actif (indication donnée par la forme) ;</li> <li>D’une modification de la taille de police dans un nuage de tags (indication donnée par la taille).</li> </ul> <p>Ou de tout autre effet graphique similaire.</p> "
    },
    {
      "title": "Indication du type de données et/ou de format",
      "body": "<p>Indication textuelle permettant à l’utilisateur de savoir quel est le type de donnée et/ou le format de saisie requis par un champ obligatoire, préalablement à son renseignement.</p> <p>Exemples :</p> <ul> <li>Courriel (format : vous@domaine.com) ;</li> <li>Code postal (format : 00000) ;</li> <li>Date (format : JJ/MM/AAAA).</li> </ul> "
    },
    {
      "title": "Information (donnée par la couleur)",
      "body": "<p>Information transmise visuellement par l’intermédiaire d’une couleur. L’indication que les champs en rouge sont obligatoires dans un formulaire, l’utilisation d’un fond bleu pour indiquer la page en cours de consultation dans un menu avec le fond vert, le changement de couleur d’un nom d’article pour indiquer son indisponibilité dans une liste d’articles sont autant d’exemples d’indication donnée par la couleur.</p> <p>Lorsqu’une information donnée par la couleur est accompagnée d’une autre méthode à destination des utilisateurs qui ne voient pas ou perçoivent mal les couleurs ou leurs associations, le critère sera considéré comme non applicable.</p> <p>Les moyens de transmettre une information autrement que par la couleur peuvent être :</p> <ul> <li>Une indication textuelle visible ;</li> <li>Un moyen faisant intervenir du graphisme (pictogramme, image de fond, forme, style de bordure différent, etc.) et par le biais d’un complément au niveau du code (<code>aria-label</code>, <code>title</code>, texte masqué, <code>aria-current</code>, etc.) ;</li> <li>Un autre style typographique (gras, italique, taille de texte, autre police, etc) et par le biais d’un complément au niveau du code (<code>aria-label</code>, <code>title</code>, texte masqué, <code>aria-current</code>, etc.).</li> </ul> "
    },
    {
      "title": "Intitulé (ou nom accessible) de lien",
      "body": "<p>« Nom accessible » restitué par les technologies d’assistance.</p> <p>Dans le cas d’un lien HTML, le « nom accessible » est obtenu selon l’ordre suivant :</p> <ul> <li>passage de texte associé par l’attribut WAI-ARIA <code>aria-labelledby</code> ;</li> <li>sinon, contenu de l’attribut WAI-ARIA <code>aria-label</code> ;</li> <li>sinon, contenu du lien ;</li> <li>sinon, contenu de l’attribut <code>title</code>.</li> </ul> <p>Cet ordre doit être utilisé pour déterminer ce qui constitue l’intitulé du lien. Par exemple :</p> <ul> <li>en cas de présence conjointe d’un attribut WAI-ARIA <code>aria-label</code> et d’un attribut WAI-ARIA <code>aria-labelledby</code>, c’est le passage de texte référencé par l’attribut WAI-ARIA <code>aria-labelledby</code> qui doit être considéré comme l’intitulé ;</li> <li>en cas de présence conjointe d’un attribut WAI-ARIA <code>aria-label</code> et d’un contenu dans le lien, c’est le contenu de l’attribut WAI-ARIA <code>aria-label</code> qui doit être considéré comme l’intitulé.</li> </ul> <p>Référence : <span lang=\"en\"><a href=\"https://www.w3.org/TR/accname-1.1/\">Accessible name and description calculation</a></span>.</p> <p>Dans le cas où le « nom accessible » est obtenu à partir du contenu du lien, celui-ci sera variable en fonction des cas suivants :</p> <p>Lien texte :</p> <p>En HTML, le « nom accessible » correspond au texte constitué à partir :</p> <ul> <li>du texte contenu dans le lien ;</li> <li>du texte contenu dans les éléments enfants du lien.</li> </ul> <p>Lien image :</p> <p>En HTML, le « nom accessible » correspond au texte constitué à partir de l’alternative textuelle d’une ou plusieurs images dans le lien du type :</p> <ul> <li>Image (élément <code>&lt;img&gt;</code> ou balise ouvrante ayant l’attribut WAI-ARIA <code>role=&quot;img&quot;</code>) ;</li> <li>Image objet (élément <code>&lt;object&gt;</code>) ;</li> <li>Image bitmap (élément <code>&lt;canvas&gt;</code>) ;</li> <li>Image vectorielle (élément <code>&lt;svg&gt;</code>).</li> </ul> <p>Lien composite :</p> <p>En HTML, le « nom accessible » correspond au texte constitué à partir de l’ensemble :</p> <ul> <li>du texte contenu dans le lien ;</li> <li>du texte contenu dans les éléments enfant du lien ;</li> <li>du contenu de l’alternative textuelle de la ou des images comprises dans le lien.</li> </ul> <p>Dans le cas d’un lien SVG (version 1.1), le « nom accessible » est obtenu comme suit :</p> <ul> <li>Passage de texte associé par l’attribut WAI-ARIA <code>aria-labelledby</code> ;</li> <li>Sinon, contenu de l’attribut WAI-ARIA <code>aria-label</code> ;</li> <li>Sinon, contenu de l’élément <code>&lt;title&gt;</code> enfant direct du lien ;</li> <li>Sinon, contenu de l’attribut <code>xlink:title</code> ;</li> <li>Sinon, contenu texte d’un ou plusieurs éléments <code>&lt;text&gt;</code>.</li> </ul> <p>Il faut cependant être vigilant car cet algorithme de calcul n’est pas encore pris en compte et effectif au sein des différents lecteurs d’écran. À ce jour, le support est disponible avec VoiceOver, mais incomplet ou lacunaire avec JAWS et NVDA. Si bien que le plus petit dénominateur commun sur lequel il est possible de se reposer pour fournir un intitulé au lien est l’élément <code>&lt;text&gt;</code>.</p> <p>Note 1 : un intitulé de lien sera considéré comme non-explicite dans le cas où le « nom accessible » ne reprend pas l’<a href=\"#intitule-visible\">intitulé visible</a> du lien.</p> <p>Note 2 : en raison de la configuration possible des aides techniques permettant de forcer la restitution du « nom accessible » issu du contenu de l’attribut <code>title</code> au détriment du « nom accessible » issu du contenu du lien. Un intitulé de lien sera considéré comme non-explicite dans le cas où le lien possède un attribut <code>title</code> dont la valeur ne reprendrait pas au moins le « nom accessible » issu du contenu du lien.</p> <p>Note 3 : dans le cas de la présence de plusieurs liens ayant une destination différente dont le « nom accessible » est identique. L’intitulé de lien seul sera considéré comme non-explicite si le contexte de lien ne permet pas de les différencier.</p> <p>Note 4 : lorsqu’un lien ne comporte aucun contenu, il sera non conforme au regard du <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#10.2\">critère 10.2</a> et du <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#6.2\">critère 6.2</a>.</p> <p>Note 5 : bien que le calcul du nom accessible d’un lien tienne compte de contenus texte générés en CSS via les pseudo-éléments <code>::before</code> et <code>::after</code>, cette pratique ne doit pas être utilisée, car elle constitue une non-conformité au critère 1.3.1 des <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> 2.1 (cf. <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F87\">F87</a>).</p> "
    },
    {
      "title": "Intitulé visible",
      "body": "<p>Texte affiché faisant office d’intitulé visible à l’écran au sein d’un bouton ou d’un lien.</p> <p>Texte affiché faisant office d’<a href=\"#etiquette-de-champ-de-formulaire\">étiquette</a> pour un champ formulaire.</p> <p>Ce texte peut être constitué de texte ou d’une image contenant du texte.</p> "
    },
    {
      "title": "Items de même nature d’une liste de choix",
      "body": "<p>Dans une liste déroulante (balise <code>&lt;select&gt;</code>), ensemble d’items (balises <code>&lt;option&gt;</code>) pouvant être regroupés par leur nature. Le regroupement vise à identifier les items devant être traités comme un ensemble (par exemple, une liste de départements regroupés par régions).</p> "
    },
    {
      "title": "Landmarks",
      "body": "<p>WAI-ARIA propose des rôles permettant d’indiquer les zones principales (régions) du document. Ces rôles sont très profitables aux utilisateurs de lecteurs d’écran notamment, mais également aux utilisateurs de la navigation au clavier qui peuvent ainsi bénéficier de fonctionnalités de navigation rapide dans la <a href=\"#structure-du-document\">structure du document</a>.</p> <p>Les rôles doivent être définis dans le document en fonction de la nature de la zone :</p> <ul> <li>La zone d’<a href=\"#zone-d-en-tete\">en-tête</a> doit avoir un attribut WAI-ARIA <code>role=&quot;banner&quot;</code> ;</li> <li>Le <a href=\"#menu-et-barre-de-navigation\">menu de navigation</a> principal doit avoir un attribut WAI-ARIA <code>role=&quot;navigation&quot;</code> ;</li> <li>La zone de <a href=\"#zone-de-contenu-principal\">contenu principal</a> doit avoir un attribut WAI-ARIA <code>role=&quot;main&quot;</code> ;</li> <li>La zone de <a href=\"#zone-de-pied-de-page\">pied de page</a> doit avoir un attribut WAI-ARIA <code>role=&quot;contentinfo&quot;</code> ;</li> <li>La zone de <a href=\"#moteur-de-recherche-interne-a-un-site-web\">moteur de recherche</a> sur le site doit avoir un attribut WAI-ARIA <code>role=&quot;search&quot;</code>.</li> </ul> <p>Note 1 : Si la plupart des lecteurs d’écran mettent à disposition ces fonctionnalités, les navigateurs n’ont pas encore proposé de fonctionnalité de navigation dédiée pour les utilisateurs qui ne peuvent pas utiliser la souris. La mise en place des liens d’évitement reste donc à privilégier par rapport aux landmarks.</p> <p>Note 2 : Les rôles WAI-ARIA <code>banner</code>, <code>main</code> et <code>contentinfo</code> doivent être uniques dans la page. Le rôle WAI-ARIA <code>navigation</code> est réservé aux zones de navigations principales et secondaires. Lorsqu’il y a plusieurs rôles WAI-ARIA <code>navigation</code>, il peut être utile de les différencier en précisant un nom à chacune des zones via l’attribut WAI-ARIA <code>aria-label</code> ou <code>aria-labelledby</code>.</p> "
    },
    {
      "title": "Langue par défaut",
      "body": "<p>Indication de la langue de traitement principale du document qui peut être présente sur l’élément racine <code>html</code> ou sur chaque élément de la page concerné via les attributs <code>lang</code> et/ou <code>xml:lang</code> selon le schéma suivant :</p> <ul> <li>Pour HTML jusqu’à la version 4.01 : attribut <code>lang</code> obligatoire, attribut <code>xml:lang</code> non supporté ;</li> <li>Pour XHTML 1.0 servi en <code>&quot;text/html&quot;</code> : attribut <code>lang</code> et <code>xml:lang</code> obligatoires ;</li> <li>Pour XHTML 1.0 servi en <code>&quot;application/xhtml+xml&quot;</code> : attribut <code>xml:lang</code> obligatoire, attribut <code>lang</code> recommandé ;</li> <li>Pour XHTML 1.1 : attribut <code>xml:lang</code> obligatoire, attribut <code>lang</code> non supporté ;</li> <li>Pour HTML5 : attribut <code>lang</code> obligatoire.</li> </ul> "
    },
    {
      "title": "Le nom, le rôle, la valeur, le paramétrage et les changements d’états",
      "body": "<p>Un composant doit avoir un rôle et un nom appropriés. Ses valeurs, états et paramètres éventuels doivent également être accessibles et correctement transmis aux APIs d’accessibilité notamment.</p> <p>Un composant peut s’appuyer sur un élément interactif HTML ou sur un élément non interactif surchargé par WAI-ARIA via un rôle ad hoc. Important : les boutons (balises <code>&lt;button&gt;</code> ou <code>&lt;input type=&quot;button&quot;&gt;</code>) lorsqu’ils sont contrôlés via JavaScript sont à évaluer avec le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#7.1\">critère 7.1</a>.</p> <p>Le nom peut être l’intitulé du composant (l’intitulé d’un bouton, par exemple).</p> <p>La valeur est, par exemple, l’élément sélectionné d’une liste déroulante ou la valeur actuelle d’un curseur (slider).</p> <p>Le rôle correspond au type d’élément défini par la spécification HTML ou WAI-ARIA (comme la balise <code>&lt;button&gt;</code> ou l’attribut WAI-ARIA <code>role=&quot;button&quot;</code>).</p> <p>Le paramétrage correspond aux informations particulières d’un composant, généralement mis à disposition par WAI-ARIA. Par exemple <code>aria-controls</code> est un paramètre qui transmet aux APIs l’information que le composant contrôle tel ou tel contenu (référencé par son identifiant - attribut <code>id</code>).</p> <p>Les changements d’état sont également mis à disposition par WAI-ARIA. Par exemple <code>aria-expanded</code> est un état permettant de signaler aux APIs que le composant est « ouvert » ou « fermé ». À noter qu’un état peut également être transmis via le nom, lorsque l’intitulé est changé dynamiquement pour correspondre à l’état de la zone contrôlée notamment.</p> <p>Ces paramètres ne sont pas obligatoires mais peuvent être requis s’ils sont indispensables pour rendre le composant accessible. C’est à l’auditeur de considérer les cas où ces paramètres sont indispensables en fonction du contexte lié à l’utilisation du composant.</p> <p>L’auditeur doit également vérifier que, lorsqu’ils sont présents, ces paramètres sont correctement utilisés.</p> <p>Pour ce faire (s’il juge cela pertinent compte tenu du contexte d’implémentation des composants et des choix ergonomiques mis en œuvre) il peut s’appuyer sur les recommandations d’utilisation de WAI-ARIA pour les composants ayant des attributs WAI-ARIA correspondant à un motif de conception tel que décrit dans le document <span lang=\"en\"><a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a></span>.</p> <p>Note : les rôles, propriétés et états WAI-ARIA s’implémentent via des attributs, par exemple <code>role=&quot;banner&quot;</code>, <code>aria-hidden=&quot;true&quot;</code>.</p> "
    },
    {
      "title": "Légende d’image",
      "body": "<p>Lorsqu’un texte, adjacent à une image, contient des informations sur l’image (par exemple un copyright, une date, un auteur…) ou est destiné à compléter les informations apportées par l’image (par exemple un texte associé à une image dans une galerie d’images), on parle de légende d’image.</p> <p>Lorsqu’une image est légendée il est nécessaire d’associer la légende de l’image à l’image par une relation de structure, de telle sorte que les technologies d’assistance puissent traiter l’image et sa légende comme un ensemble unique.</p> <p>HTML5 propose d’associer une légende à une image via les éléments <code>figure</code> (l’ensemble de l’image et la légende) et <code>figcaption</code> (la légende).</p> <p>Une image sans légende peut définir :</p> <ul> <li>Une image qui n’est pas insérée dans un élément <code>figure</code> ;</li> <li>Une image insérée dans un élément <code>figure</code> sans élément <code>figcaption</code>.</li> </ul> <p>Note : lorsque le texte adjacent à l’image peut faire office de texte de remplacement, il n’est pas obligatoire de recourir à l’ensemble <code>figure</code>, <code>figcaption</code>, l’image pouvant être simplement traitée comme une image de décoration.</p> <p>Vous pouvez consulter, à ce sujet, la note <span lang=\"en\"><a href=\"https://www.w3.org/TR/html51/semantics-embedded-content.html#alt-text\">Requirements for providing text to act as an alternative for images</a></span> du W3C.</p> "
    },
    {
      "title": "Légende",
      "body": "<p>HTML propose un dispositif permettant de titrer les groupes de champs de même nature par l’intermédiaire des éléments <code>&lt;fieldset&gt;</code> et <code>&lt;legend&gt;</code>.</p> <p>Il est également possible de créer des regroupements avec le rôle WAI-ARIA <code>group</code> et un passage de texte, faisant office de légende, lié par l’attribut WAI-ARIA <code>aria-labelledby</code> ou fourni par un attribut WAI-ARIA <code>aria-label</code>.</p> <p>Note 1 : Les regroupements de champs peuvent utiliser d’autres méthodes qui associent l’information du regroupement directement dans l’étiquette du champ. Par exemple, par l’intermédiaire d’un attribut <code>title</code>, d’un attribut WAI-ARIA <code>aria-label</code>, d’une liaison <code>aria-labelledby</code> faisant office d’étiquette ou encore par l’attribut WAI-ARIA <code>aria-describedby</code> associant un texte complémentaire. Dans ce cas, le regroupement de champs devient inutile puisque les labels sont suffisamment pertinents.</p> <p>Note 2 : Lorsque le formulaire est constitué d’un seul bloc d’informations de même nature (l’identité et l’adresse de l’utilisateur, par exemple) ou d’un champ unique (un moteur de recherche, par exemple), le regroupement des champs n’est pas obligatoire.</p> "
    },
    {
      "title": "Lien composite",
      "body": "<p>En HTML, <a href=\"#lien\">lien</a> contenant à la fois du texte et un ou plusieurs enfants de type image :</p> <ul> <li>Image (balise <code>&lt;img&gt;</code> ou balise ouvrante ayant l’attribut WAI-ARIA <code>role=&quot;img&quot;</code>) ;</li> <li>Zone cliquable (balise <code>&lt;area&gt;</code>) possédant un attribut <code>href</code> ;</li> <li>Image objet (balise <code>&lt;object&gt;</code>) ;</li> <li>Image bitmap (balise <code>&lt;canvas&gt;</code>) ;</li> <li>Image vectorielle (balise <code>&lt;svg&gt;</code>).</li> </ul> <p>Note importante: il est rappelé que l’utilisation de deux liens adjacents (lien image et lien texte) et identiques constitue une gêne importante pour l’utilisateur. Même si cela ne constitue pas une non-conformité, cet usage devrait être évité. Une manière de traiter ce type de liens est d’inclure l’image dans le lien texte de façon à constituer un lien composite, ce qui évitera la redondance.</p> <p>Vous pouvez consulter à ce sujet la technique <span lang=\"en\"><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H2\">H2 : Combining adjacent image and text links for the same resource</a></span>.</p> "
    },
    {
      "title": "Lien dont la nature n’est pas évidente",
      "body": "<p>Lien qui peut être confondu avec un texte normal lorsqu’il est signalé uniquement par la couleur par certains types d’utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte “Nouvelle grève à la SNCF”, si le mot “grève” est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé.</p> <p>Note : “signalés uniquement par la couleur” signifie que le lien n’est accompagné d’aucun marqueur visuel (icône, soulignement, bordure…). En conséquence, un lien de la même couleur que le texte environnant est concerné par ce critère.</p> "
    },
    {
      "title": "Lien image",
      "body": "<p>En HTML, <a href=\"#lien\">lien</a> contenant uniquement un ou plusieurs enfants de type image :</p> <ul> <li>Image (balise <code>&lt;img&gt;</code> ou balise ouvrante ayant l’attribut WAI-ARIA <code>role=&quot;img&quot;</code>) ;</li> <li>Zone cliquable (balise <code>&lt;area&gt;</code>) possédant un attribut <code>href</code> ;</li> <li>Image objet (balise <code>&lt;object&gt;</code>) ;</li> <li>Image bitmap (balise <code>&lt;canvas&gt;</code>) ;</li> <li>Image vectorielle (balise <code>&lt;svg&gt;</code>).</li> </ul> "
    },
    {
      "title": "Lien ou bouton adjacent",
      "body": "<p>Lien ou bouton présenté de manière adjacente à un élément dans la page. Le lien ou bouton doit être adjacent visuellement dans la représentation graphique (CSS activé) et dans le code HTML. Dans le code HTML, le lien ou bouton doit se situer juste avant ou juste après l’élément auquel il est adjacent.</p> "
    },
    {
      "title": "Lien SVG",
      "body": "<p>Lien contenu dans un élément <code>&lt;svg&gt;</code>.</p> <p>Dans le cas d’un lien SVG (version 1.1), le « nom accessible » est obtenu comme suit :</p> <ul> <li>Passage de texte associé par l’attribut WAI-ARIA <code>aria-labelledby</code> ;</li> <li>Sinon, contenu de l’attribut WAI-ARIA <code>aria-label</code> ;</li> <li>Sinon, contenu de l’élément <code>&lt;title&gt;</code> enfant direct du lien ;</li> <li>Sinon, contenu de l’attribut <code>xlink:title</code> ;</li> <li>Sinon, contenu texte d’un ou plusieurs éléments <code>&lt;text&gt;</code>.</li> </ul> <p>Il faut cependant être vigilant car cet algorithme de calcul n’est pas encore pris en compte et effectif au sein des différents lecteurs d’écran. À ce jour, le support est disponible avec VoiceOver, mais incomplet ou lacunaire avec JAWS et NVDA. Si bien que le plus petit dénominateur commun sur lequel il est possible de se reposer pour fournir un intitulé au lien est l’élément <code>&lt;text&gt;</code>.</p> "
    },
    {
      "title": "Lien texte",
      "body": "<p>En HTML, <a href=\"#lien\">lien</a> ne contenant aucun élément enfant de type :</p> <ul> <li>Image (balise <code>&lt;img&gt;</code> ou balise ouvrante ayant l’attribut WAI-ARIA <code>role=&quot;img&quot;</code>) ;</li> <li>Image objet (balise <code>&lt;object&gt;</code>) ;</li> <li>Image bitmap (balise <code>&lt;canvas&gt;</code>) ;</li> <li>Image vectorielle (balise <code>&lt;svg&gt;</code>).</li> </ul> "
    },
    {
      "title": "Lien",
      "body": "<p>En HTML :</p> <ul> <li>Balise <code>&lt;a&gt;</code> possédant un attribut <code>href</code>;</li> <li>Balise possédant un attribut WAI-ARIA <code>role=&quot;link&quot;</code> et dont l’action de navigation est prise en charge par un script.</li> </ul> <p>En SVG :</p> <ul> <li>Balise <code>&lt;a&gt;</code> possédant un attribut <code>xlink:href</code> en SVG 1.1.</li> </ul> "
    },
    {
      "title": "Liens d’évitement ou d’accès rapide",
      "body": "<p>Liens dont la fonction est de permettre de naviguer à l’intérieur de la page (lien d’évitement, lien d’accès au formulaire de recherche ou au menu…). Ces liens peuvent soit permettre d’accéder à une zone de la page (lien d’accès rapide) ou de sauter une zone dans la page (lien d’évitement).</p> <p>Note 1 : Un lien d’évitement ou d’accès rapide fonctionnel est un lien dont l’activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l’utilisation des navigateurs et des aides techniques retenus dans l’environnement de test (ou « base de référence ») de l’audit.</p> <p>Note 2 : les liens d’évitements ou d’accès rapide doivent être situés à la même place dans la présentation et dans le même ordre relatif dans le code source afin de satisfaire au <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>.</p> "
    },
    {
      "title": "Liste des valeurs possibles pour l’attribut `autocomplete`",
      "body": "<p><a href=\"https://www.w3.org/Translations/WCAG21-fr/#input-purposes\">La liste des valeurs</a> disponibles est fournie par la spécification WCAG 2.1 :</p> <ul> <li><code>name</code> - Nom complet ;</li> <li><code>honorific-prefix</code> - Abréviation, civilité ou titre ;</li> <li><code>given-name</code> - Prénom ;</li> <li><code>additional-name</code> - Prénoms additionnels ;</li> <li><code>family-name</code> - Nom de famille ;</li> <li><code>honorific-suffix</code> - Suffixe honorifique ;</li> <li><code>nickname</code> - Surnom, diminutif ;</li> <li><code>organization-title</code> - Fonction, intitulé de poste ;</li> <li><code>username</code> - Nom d’utilisateur ;</li> <li><code>new-password</code> - Nouveau mot de passe (par exemple, lors de la création d’un compte ou d’un changement de mot de passe) ;</li> <li><code>current-password</code> - Mot de passe actuel pour le compte identifié par le champ <code>username</code> (par exemple, lors d’une connexion) ;</li> <li><code>organization</code> - Nom de l’organisation correspondant à la personne, à l’adresse ou à l’information de contact dans les autres champs associés avec ce champ ;</li> <li><code>street-address</code> - Adresse postale (multiligne, nouvelles lignes conservées) ;</li> <li><code>address-line1</code> - Adresse postale (une ligne par champ, ligne 1) ;</li> <li><code>address-line2</code> - Adresse postale (une ligne par champ, ligne 2) ;</li> <li><code>address-line3</code> - Adresse postale (une ligne par champ, ligne 3) ;</li> <li><code>address-level4</code> - Le niveau administratif le plus détaillé, pour les adresses pourvues de quatre niveaux administratifs ;</li> <li><code>address-level3</code> - Le troisième niveau administratif, pour les adresses pourvues d’au moins trois niveaux administratifs ;</li> <li><code>address-level2</code> - Le deuxième niveau administratif, pour les adresses pourvues d’au moins deux niveaux administratifs ;</li> <li><code>address-level1</code> - Le plus large niveau administratif d’une adresse, c’est-à-dire la province dans laquelle se trouve la localité ;</li> <li><code>country</code> - Code pays ;</li> <li><code>country-name</code> - Nom de pays ;</li> <li><code>postal-code</code> - Code postal, code CEDEX (si le CEDEX est présent, ajouter “CEDEX”, et ce qui le suit doit être ajouté dans le champ <code>address-level2</code>) ;</li> <li><code>cc-name</code> - Nom complet figurant sur le moyen de paiement ;</li> <li><code>cc-given-name</code> - Prénom figurant sur le moyen de paiement ;</li> <li><code>cc-additional-name</code> - Prénoms additionnels figurant sur le moyen de paiement cc-family-name - Nom de famille figurant sur le moyen de paiement ;</li> <li><code>cc-number</code> - Code identifiant le moyen de paiement (e.g., un numéro de carte bancaire) ;</li> <li><code>cc-exp</code> - Date d’expiration du moyen de paiement ;</li> <li><code>cc-exp-month</code> - Le mois de la date d’expiration du moyen de paiement ;</li> <li><code>cc-exp-year</code> - L’année de la date d’expiration du moyen de paiement ;</li> <li><code>cc-csc</code> - Code de sécurité du moyen de paiement <span lang=\"en\">(also known as the card security code (CSC), card validation code (CVC), card verification value (CVV), signature panel code (SPC), credit card ID (CCID), etc.)</span> ;</li> <li><code>cc-type</code> - Type de moyen de paiement (e.g. Visa) ;</li> <li><code>transaction-currency</code> - La devise qui a la préférence de l’utilisateur lors d’une transaction ;</li> <li><code>transaction-amount</code> - Le montant qui a la préférence de l’utilisateur lors d’une transaction (e.g., en réponse à une enchère ou à un prix soldé) ;</li> <li><code>language</code> - Langue préférée ;</li> <li><code>bday</code> - Date d’anniversaire ;</li> <li><code>bday-day</code> - Le jour de la date d’anniversaire ;</li> <li><code>bday-month</code> - Le mois de la date d’anniversaire ;</li> <li><code>bday-year</code> - L’année de la date d’anniversaire ;</li> <li><code>sex</code> - Identité sexuelle ;</li> <li><code>url</code> - Page d’accueil ou une autre page Web correspondant à l’organisation, la personne, l’adresse ou à l’information de contact dans les autres champs associés avec ce champ ;</li> <li><code>photo</code> - Photographie, icône ou une autre image correspondant à l’organisation, la personne, l’adresse ou à l’information de contact dans les autres champs associés avec ce champ ;</li> <li><code>tel</code> - Numéro de téléphone complet, y compris le code pays ;</li> <li><code>tel-country-code</code> - Code pays du numéro de téléphone ;</li> <li><code>tel-national</code> - Numéro de téléphone sans la partie code pays, avec un préfixe interne au pays, s’il y a lieu ;</li> <li><code>tel-area-code</code> - Indicatif régional du numéro de téléphone, avec un préfixe interne au pays, s’il y a lieu ;</li> <li><code>tel-local</code> - Numéro de téléphone sans la partie code pays ni l’indicatif régional ;</li> <li><code>tel-local-prefix</code> - La première partie du composant du numéro de téléphone qui suit l’indicatif régional, lorsque ce composant est scindé en deux parties ;</li> <li><code>tel-local-suffix</code> - La seconde partie du composant du numéro de téléphone qui suit l’indicatif régional, lorsque ce composant est scindé en deux parties ;</li> <li><code>tel-extension</code> - Numéro de téléphone d’un poste interne ;</li> <li><code>email</code> - Adresse électronique ;</li> <li><code>impp</code> - URL correspondant d’un protocole de messagerie instantanée (par exemple, <code>&quot;aim:goim?screenname=example&quot;</code> ou <code>&quot;xmpp:fred@example.net&quot;</code>).</li> </ul> "
    },
    {
      "title": "Listes",
      "body": "<p>Suite d’éléments pouvant être regroupés sous la forme d’une liste structurée ordonnée, non ordonnée ou de définition. Par exemple la suite des liens d’un menu de navigation est une liste de liens non ordonnée, les différentes étapes d’une procédure sont une liste d’éléments ordonnés, le couple terme/description d’un glossaire est une liste de description. En HTML, les listes utilisent les balises suivantes :</p> <ul> <li>Liste ordonnée : balises <code>&lt;ol&gt;</code> et <code>&lt;li&gt;</code> (chaque élément de la liste est affecté d’un marqueur indexé) ;</li> <li>Liste non ordonnée : balises <code>&lt;ul&gt;</code> et <code>&lt;li&gt;</code> (chaque élément de la liste est affecté d’un marqueur non-indexé ;</li> <li>Liste de description : balises <code>&lt;dl&gt;</code>, <code>&lt;dt&gt;</code> (terme à décrire) et <code>&lt;dd&gt;</code> (description).</li> </ul> <p>Note 1 : En HTML5, la balise <code>&lt;dl&gt;</code> ne représente plus seulement une liste de définition, mais de manière générique toute liste de description qui peut comprendre comme groupe de termes-descriptions des noms et des définitions, des questions et réponses, des catégories et des sujets, etc.</p> <p>Note 2 : Il est également possible de structurer les listes à l’aide des attributs WAI-ARIA <code>role=&quot;list&quot;</code> et <code>role=&quot;listitem&quot;</code> pour les listes ordonnées et non ordonnées.</p> <p>Note 3 : la notion de « regroupés visuellement sous forme de liste » se caractérise par :</p> <ul> <li>La présence d’un marqueur visuel permettant de faire comprendre qu’il s’agit d’une liste non ordonnée par exemple <code>-</code>, <code>•</code>, <code>\\*</code>, etc. ;</li> <li>La présence d’un marqueur visuel permettant de faire comprendre qu’il s’agit d’une liste ordonnée par exemple un chiffre, une lettre grecque, etc. ;</li> <li>La présence d’une série d’éléments se suivant visuellement les uns les autres, avec une forme visuelle, une nature et un fonctionnement identique, mais sans avoir directement de marqueur visuel de liste (non ordonnée ou ordonnée), par exemple un menu de navigation.</li> </ul> <p>Attention cependant toutes les listes ne nécessitent pas obligatoirement une structure de liste, par exemple une série de termes séparés par une virgule.</p> "
    },
    {
      "title": "Mécanisme de remplacement",
      "body": "<p>Mécanisme généralement basé sur CSS, permettant à l’utilisateur de remplacer du texte par du texte en image et inversement sur le principe du style switcher. Le mécanisme peut utiliser un langage de script côté serveur ou un langage de script côté client.</p> "
    },
    {
      "title": "Mécanisme qui permet d’afficher un rapport de contraste conforme",
      "body": "<p>Composant d’interface dont l’activation permet de modifier l’apparence du site ou de la page de manière à afficher les contenus avec un ratio de contraste suffisant. Le design de ce composant d’interface devra être conforme au <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.2\">critère 3.2</a> et au <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.3\">critère 3.3</a> sans avoir recours lui-même à un mécanisme permettant d’afficher un rapport de contraste conforme. Ce mécanisme doit conserver à l’identique les contenus et les fonctionnalités du site ou de la page qu’il modifie.</p> "
    },
    {
      "title": "Média non temporel",
      "body": "<p>Contenu qui ne se déroule pas dans le temps, consultable via un plugin (Flash, Java, Silverlight…) ou via les éléments <code>svg</code> et <code>canvas</code> ; par exemple, une carte interactive en Flash, une application Flash ou Java, un diaporama sont des médias non temporels. Un média non temporel peut contenir des médias temporels (un lecteur Flash qui propose une liste de vidéos à consulter, par exemple).</p> <p>Note : l’utilisation du paramètre <code>wmode</code> pour un objet Flash avec les valeurs <code>&quot;transparent&quot;</code> et <code>&quot;opaque&quot;</code> invalide de fait le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#4.13\">critère 4.13</a>. En effet, l’utilisation de ces valeurs a pour conséquence que l’animation Flash vue du côté des utilisateurs de lecteur d’écran est invisible.</p> "
    },
    {
      "title": "Média temporel (type son, vidéo et synchronisé)",
      "body": "<ul> <li>Média temporel seulement audio : contenu sonore (Wav, Mp3…) ;</li> <li>Média temporel seulement vidéo : images ou photos en mouvement ou en séquence ;</li> <li>Média temporel synchronisé : flux audio ou vidéo synchronisé avec un autre format pour présenter de l’information et/ou comportant des composants temporels interactifs. Un média temporel peut être consulté de 2 manières différentes :</li> </ul> <ul> <li>Fichier à télécharger consultable avec un logiciel externe à la page web ;</li> <li>Contenu embarqué dans la page web et consultable dans la page web via : <ul> <li>Un plugin (par exemple une vidéo diffusée par un lecteur Flash) ;</li> <li>L’élément <code>&lt;video&gt;</code> (par exemple une vidéo) ;</li> <li>L’élément <code>&lt;audio&gt;</code> (par exemple un podcast) ;</li> <li>L’élément <code>&lt;svg&gt;</code> (par exemple un dessin animé vectoriel) ;</li> <li>L’élément <code>&lt;canvas&gt;</code> (par exemple un dessin animé en image bitmap) ;</li> <li>L’élément <code>&lt;bgsound&gt;</code> pour diffuser un arrière-plan sonore à la page web.</li> </ul> </li> </ul> <p>Un média temporel peut être diffusé en temps réel ou être proposé en lecture de manière asynchrone (média pré-enregistré).</p> <p>Note 1 : l’utilisation du paramètre <code>wmode</code> pour un objet Flash avec les valeurs <code>&quot;transparent&quot;</code> et <code>&quot;opaque&quot;</code> invalide de fait le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#4.13\">critère 4.13</a>. En effet, l’utilisation de ces valeurs a pour conséquence que l’animation Flash vue du côté des utilisateurs de lecteur d’écran est invisible.</p> <p>Note 2 : les gif animés, les animations d’images réalisées par JavaScript ou CSS ne sont pas considérés comme étant des médias temporels.</p> <p>Note 3 : l’élément <code>&lt;bgsound&gt;</code> est spécifique à Internet Explorer et ne devrait pas être utilisé.</p> "
    },
    {
      "title": "Menu et barre de navigation",
      "body": "<p>Liste de liens permettant une navigation spécifique dans le site, dans une rubrique ou dans une collection de pages.</p> <p>Les principales barres de navigation (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>) sont :</p> <ul> <li>Un menu de navigation ;</li> <li>Un fil d’ariane ;</li> <li>Une liste de navigation d’une liste de résultats ;</li> <li>Des liens d’évitement.</li> </ul> <p>Il existe différents types de menu de navigation (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.1\">critère 12.1</a> et <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>) :</p> <ul> <li>Menu de navigation principal ;</li> <li>Menu de sous-rubrique ;</li> <li>Menu contextuel ;</li> <li>Table des matières concernant un ensemble de pages.</li> </ul> <p>Note : Les liens de pied de page renvoyant vers les mentions légales, plan du site et autres informations concernant le site ne sont pas considérés comme un menu de navigation principal.</p> "
    },
    {
      "title": "Message de statut",
      "body": "<p>Un message de statut informe l’utilisateur d’un changement de contenu dans la page sans interrompre son activité principale (il n’y a pas de changement de contexte par exemple un repositionnement du focus sur le message).</p> <p>Un message de statut peut informer sur :</p> <ul> <li>Le succès ou le résultat d’une action ;</li> <li>L’état occupé d’une application ;</li> <li>L’état de progression d’un processus ;</li> <li>L’existence d’erreur.</li> </ul> "
    },
    {
      "title": "Modifier ou annuler les données et les actions effectués",
      "body": "<p>Procédés par lesquels un utilisateur peut modifier les données qu’il a saisies, faire annuler sa saisie ou faire annuler les actions découlant de sa saisie par exemple annuler une commande ou un virement bancaire.</p> <p>Note : La page contenant un formulaire qui modifie ou supprime des données, ou qui transmet des réponses à un test ou un examen, ou dont la validation a des conséquences financières ou juridiques, doit indiquer explicitement la durée pendant laquelle l’utilisateur peut demander l’annulation de sa saisie. Elle devra également contenir la procédure à effectuer pour annuler cette saisie. Cette procédure n’a pas à être obligatoirement réalisable en ligne même si cela reste recommandé.</p> "
    },
    {
      "title": "Moteur de recherche (interne à un site web)",
      "body": "<p>Zone donnant accès directement (formulaire) ou indirectement (élément d’interface donnant accès au formulaire) au moteur de recherche qui permet d’effectuer des recherches sur les contenus de l’ensemble du site.</p> <p>Note : Attention à ne pas confondre cette zone de recherche, unique dans le site, avec tout autre moteur de recherche permettant par exemple de faire des recherches sur une partie restreinte du site : un catalogue, les offres sur une section marchés publics…</p> <p>Voir la définition technique de zone d’en-tête fournie par WAI-ARIA <a href=\"https://www.w3.org/TR/wai-aria-1.1/#search\"><code>search</code>(role)</a>.</p> "
    },
    {
      "title": "Motif de conception",
      "body": "<p>Un motif de conception <span lang=\"en\">(Design Pattern)</span> est un modèle défini dans le document <span lang=\"en\"><a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a></span> qui décrit la structure, les rôles et propriétés et le comportement clavier que doit respecter un composant JavaScript (widget).</p> <p>Il est recommandé que les composants développés en JavaScript utilisant des attributs WAI-ARIA correspondant à un motif de conception respectent celui-ci. Attention cependant, les motifs de conception ne sont pas tous adaptés à un usage non applicatif, en particulier pour les sites proposant un affichage en contexte mobile.</p> <p>Note 1 : compte tenu du manque de support de certaines propriétés et de certains rôles WAI-ARIA et de la grande variabilité des situations dans lesquelles un composant JavaScript peut être proposé, il est possible d’adapter des motifs de conception à des contextes ou des utilisations particulières. Dans ce cas, le motif de conception adapté doit :</p> <ul> <li>Respecter la structure générale : par exemple un ensemble de panneaux (rôle WAI-ARIA <code>tabpanel</code>) d’un système d’onglets est forcément lié à un ensemble d’onglets (rôle WAI-ARIA <code>tablist</code>) ;</li> <li>Utiliser en remplacement d’un rôle ou d’une propriété WAI-ARIA mal supporté, un rôle ou une propriété WAI-ARIA équivalent, offrant un comportement et une restitution similaire.</li> </ul> <p>Note 2 : Le fait d’enrichir un motif de conception de rôles ou propriétés WAI-ARIA supplémentaires dont la compatibilité avec l’accessibilité est contrôlée par le test de restitution sur l’environnement de test (ou « base de référence ») ne constitue pas une adaptation d’un motif de conception. Par exemple l’ajout de l’attribut WAI-ARIA <code>aria-hidden</code> sur les panneaux (rôle WAI-ARIA <code>tabpanel</code>) d’un système d’onglets ne définit pas un motif de conception adapté.</p> "
    },
    {
      "title": "Ordre de tabulation",
      "body": "<p>Ordre dans lequel le focus se déplace (vers un élément suivant ou vers un élément précédent). L’ordre naturel est celui qui est implémenté via le code source. Lorsqu’il est modifié par l’utilisation de l’attribut <code>tabindex</code> ou par l’utilisation d’une commande JavaScript, c’est l’ordre modifié qui fait référence.</p> <p>Attention : lorsqu’un élément initie un changement dans la page (changement de contexte, gestion de zones cachées, ajout de contenu, gestion de champs de formulaire…) il est nécessaire d’activer l’élément qui initie le changement pour tester la cohérence de l’ordre de tabulation.</p> "
    },
    {
      "title": "Page « plan du site »",
      "body": "<p>Page dédiée présentant l’arborescence d’un site web, généralement sous forme de listes de liens organisées en rubriques et sous-rubriques donnant accès à l’ensemble des pages du site.</p> <p>Note 1 : les liens du plan du site peuvent être constitués de balises <code>&lt;a&gt;</code> ou de balises <code>&lt;area&gt;</code>.</p> <p>Note 2 : il n’est pas nécessaire que le plan du site contienne les liens vers toutes les pages du site, en revanche il est nécessaire qu’à partir du plan du site, l’utilisateur puisse atteindre l’ensemble des pages du site.</p> "
    },
    {
      "title": "Passage de texte lié par aria-labelledby ou aria-describedby",
      "body": "<p>Il s’agit d’un ou de plusieurs passages de texte identifiés par des <code>id</code> dont la valeur est unique dans la page et associés à un élément (champ de formulaire, bouton, etc.) par les attributs WAI-ARIA <code>aria-labelledby</code> ou <code>aria-describedby</code> sur le modèle suivant : <code>aria-labelledby=&quot;ID1 ID2 ID3…&quot;</code> où la valeur de l’attribut utilisé est égale à la liste des valeurs d’attributs <code>id</code> des passages de texte à associer présents dans la page.</p> <p>Note 1 : pour assurer une compatibilité maximum avec les agents utilisateurs, notamment Internet Explorer 11, il est recommandé d’implémenter un <code>tabindex=&quot;-1&quot;</code> sur les passages de textes qui ne sont pas des éléments interactifs (bouton, liens, éléments de formulaires, etc.).</p> <p>Note 2 : la valeur des attributs WAI-ARIA <code>aria-labelledby</code> ou <code>aria-describedby</code> ne doivent pas créer de référence récursive (A référence B qui référence A) ou traversante (A qui référence B qui référence C).</p> "
    },
    {
      "title": "Présentation de l’information",
      "body": "<p>Restitution visuelle des contenus via un navigateur en mode graphique. La présentation concerne le style, la position et les dimensions des éléments HTML et de leur contenu. La présentation de l’information doit être réalisée via CSS. Les éléments (<code>basefont</code>, <code>blink</code>, <code>center</code>, <code>font</code>, <code>marquee</code>, <code>s</code>, <code>strike</code>, <code>tt</code> et <code>big</code>) et les attributs (<code>align</code>, <code>alink</code>, <code>background</code>, <code>bgcolor</code>, <code>border</code>, <code>cellpadding</code>, <code>cellspacing</code>, <code>char</code>, <code>charoff</code>, <code>clear</code>, <code>compact</code>, <code>color</code>, <code>frameborder</code>, <code>hspace</code>, <code>link</code>, <code>marginheight</code>, <code>marginwidth</code>, <code>text</code>, <code>valign</code>, <code>vlink</code>, <code>vspace</code>, <code>size</code>) sont interdits.</p> <p>Note : les attributs <code>width</code> et <code>height</code> utilisés sur d’autres éléments que les balises <code>&lt;img&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, <code>&lt;canvas&gt;</code> et <code>&lt;svg&gt;</code> sont également interdits.</p> "
    },
    {
      "title": "Pressé ou posé",
      "body": "<p>Correspond aux gestionnaires d’événement JavaScript considérés comme des événements descendants (<code>mousedown</code>, <code>touchstart</code> par exemple).</p> "
    },
    {
      "title": "Prise de focus",
      "body": "<p>La prise de focus est l’état renvoyé par un élément qui reçoit l’attention suite à une action de l’utilisateur. Il y a trois moyens en HTML de donner le focus à un élément :</p> <ul> <li>En activant l’élément par un dispositif de pointage (exemple : souris) ;</li> <li>En atteignant l’élément par la touche tabulation ou majuscule + tabulation ;</li> <li>En activant l’élément par un raccourci clavier (<code>accesskey</code>).</li> </ul> <p>Certains éléments reçoivent naturellement le focus, par exemple : <code>&lt;a href&gt;</code>, <code>&lt;area href&gt;</code>, <code>&lt;button&gt;</code>, <code>&lt;input&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;select&gt;</code>, <code>&lt;label&gt;</code>, <code>&lt;legend&gt;</code>, <code>&lt;optgroup&gt;</code>, <code>&lt;option&gt;</code> et <code>&lt;textarea&gt;</code>. Le comportement de l’élément, lors de la prise de focus, dépend de sa nature ; un lien, par exemple, devra être activé après la prise de focus (sauf utilisation de script). En revanche, un élément de formulaire, comme <code>&lt;textarea&gt;</code>, devra autoriser la saisie suite à la prise de focus. Les éléments <code>&lt;label&gt;</code> et <code>&lt;legend&gt;</code> ne reçoivent la prise de focus que via le pointeur souris. Pour l’élément <code>&lt;label&gt;</code>, le comportement attendu est de transférer la prise de focus sur l’élément qui lui est associé.</p> <p>Note 1 : la spécification WAI-ARIA étend le rôle attribué à l’attribut <code>tabindex</code> en définissant que tout élément HTML peut acquérir la possibilité de recevoir le focus en lui attribuant la valeur <code>tabindex=&quot;0&quot;</code>. En revanche, aucun comportement n’est attribué via la seule présence de <code>tabindex</code>. De même, la valeur <code>tabindex=&quot;-1&quot;</code> lorsqu’elle est utilisée sur un élément recevant naturellement le focus retire l’élément qui en est affecté du plan de tabulation en inhibant sa capacité à signaler la « prise de focus ». L’utilisation de <code>tabindex</code>, conformément à la spécification WAI-ARIA, peut valider certains tests relatifs à la gestion du focus de tabulation, notamment.</p> <p>Note 2 : l’indication visuelle du focus du navigateur ne doit pas être supprimée ou dégradée sauf si un style du focus défini par l’auteur est visible et suffisamment contrasté au regard du <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.3\">critère 3.3</a>.</p> "
    },
    {
      "title": "Procédé de rafraîchissement",
      "body": "<p>Technique visant à modifier le contenu d’un ou de plusieurs éléments de la page web. Le procédé de rafraîchissement peut s’effectuer par rechargement automatique de la page ou de manière dynamique sans rechargement de la page (via AJAX, par exemple). L’utilisateur doit pouvoir contrôler chaque procédé de rafraîchissement de manière indépendante.</p> "
    },
    {
      "title": "Propriété CSS déterminant une couleur",
      "body": "<p>Cela concerne les propriétés suivantes : <code>color</code>, <code>background-color</code>, <code>background</code>, <code>border-color</code>, <code>border</code>, <code>outline-color</code>, <code>outline</code>.</p> <p>Note : l’utilisation d’une image de fond pour insérer une couleur (propriété <code>background:url…</code>) est également concernée.</p> "
    },
    {
      "title": "Raccourci clavier",
      "body": "<p>Un moyen de déclencher une action associée à un composant de l’interface utilisateur en appuyant sur une ou plusieurs touches.</p> <p>Note : les <span lang=\"en\">« Access keys »</span> (attribut HTML <code>accesskey</code>) sont bien des raccourcis clavier, mais ils ne sont pas concernés par le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.10\">critère 12.10</a> dans la mesure où leur activation nécessite déjà l’usage de touches de modification (variables suivant les navigateurs).</p> "
    },
    {
      "title": "Redirection",
      "body": "<p>Procédé qui consiste pour l’affichage d’une page sur le poste client à rediriger l’utilisateur vers une autre page, sur le même domaine ou sur un domaine différent.</p> "
    },
    {
      "title": "Règles d’écriture",
      "body": "<p>Le code source doit respecter les règles suivantes en accord avec la déclaration de type de document utilisée dans la page :</p> <ul> <li>Pas de balise ouvrante ou fermante sans <code>&lt;</code> ou <code>&gt;</code> (exemple d’erreur : <code>li&gt;vélo</code>) ;</li> <li>pas de balise fermante avec <code>/</code> manquant (exemple d’erreur : <code>&lt;li&gt;vélo&lt;li&gt;</code>) ;</li> <li>pas de valeur d’attribut avec des <code>“</code> ou <code>‘</code> manquant (exemple d’erreur : <code>alt=&quot;vélo</code>) ;</li> <li>pas de valeurs multiples d’attribut séparées par un espace sans <code>“</code> ou <code>‘</code> (exemple d’erreur : <code>alt=mon beau vélo</code>) ;</li> <li>pas d’espace manquant entre les attributs (exemple : <code>alt=”vélo”title=”vélo”</code>) ;</li> <li>pas de balise fermante manquante pour les éléments qui en exigent une (exemple d’erreur : <code>&lt;object&gt;</code> sans <code>&lt;/object&gt;</code>).</li> </ul> "
    },
    {
      "title": "Relâché ou relevé",
      "body": "<p>Correspond aux gestionnaires d’événement JavaScript considérés comme des événements ascendants (<code>mouseup</code>, <code>touchend</code> par exemple).</p> "
    },
    {
      "title": "Résumé (de tableau)",
      "body": "<p>Un résumé est un passage de texte associé à un tableau de données complexe. Il permet de donner des informations sur la nature et la structure du tableau afin d’en faciliter l’utilisation par les utilisateurs de technologies d’assistance par exemple.</p> <p>Note : en HTML5, la seule technique utilisable actuellement est celle qui consiste à insérer le résumé directement dans le titre (balise <code>&lt;caption&gt;</code>) en masquant le résumé via CSS si nécessaire.</p> <p>Dans les versions précédentes de HTML, le résumé peut être inséré via un attribut <code>summary</code> sur la balise <code>&lt;table&gt;</code>.</p> <p>Dans le cas d’une balise avec l’attribut WAI-ARIA <code>role=&quot;table&quot;</code>, le résumé doit être fourni au moyen d’un attribut <code>aria-describedby</code> et être correctement restitué par les technologies d’assistance.</p> "
    },
    {
      "title": "Script",
      "body": "<p>Code généralement écrit sous forme d’une liste de commandes (par exemple JavaScript). Les langages interprétés côté client nécessitent un navigateur compatible sur lequel l’exécution du langage est active. Les commandes d’un langage de script côté client peuvent être embarquées ou contenues dans un fichier externe. Dans les deux cas, l’insertion se fait via la balise <code>&lt;script&gt;</code>.</p> "
    },
    {
      "title": "Sens de lecture",
      "body": "<p>Indique le sens de lecture du document ou d’un passage de texte via l’attribut <code>dir</code>, <code>dir=&quot;ltr&quot;</code>, par exemple. Les deux valeurs reconnues sont :</p> <ul> <li><code>ltr</code> (left to right) indique un sens de lecture de gauche à droite ;</li> <li><code>rtl</code> (right to left) indique un sens de lecture de droite à gauche.</li> </ul> <p>Note : en l’absence d’indication de sens de lecture via l’attribut <code>dir</code> sur l’élément <code>html</code>, <code>body</code>, ou un des parents du texte analysé, le sens de lecture par défaut est de gauche à droite (valeur <code>ltr</code>).</p> "
    },
    {
      "title": "Site web",
      "body": "<p>Ensemble de toutes les pages web :</p> <ul> <li>Reliées par des liens web ;</li> <li>Appartenant au même nom de domaine (ex : design.numerique.gouv.fr) ;</li> <li>Qui constituent un ensemble cohérent du point de vue de l’utilisateur.</li> </ul> <p>Cas particulier des pages web d’un sous-domaine ; un sous-domaine peut :</p> <ul> <li>Soit appartenir au site web attaché au nom de domaine, si l’utilisateur en a une perception cohérente avec les autres pages du site web (par exemple : même structure, même navigation…) ;</li> <li>Soit ne pas appartenir au site web attaché au nom de domaine (par exemple : différents blogs en sous-domaine d’un nom de domaine et sans relation les uns avec les autres).</li> </ul> "
    },
    {
      "title": "Sous-titres synchronisés (objet multimédia)",
      "body": "<p>Texte des informations audio (paroles d’un personnage, bruit important pour comprendre l’action…) présentes dans un média temporel et affiché de manière synchrone avec le flux de l’objet multimédia.</p> <p>Note 1 : pour différencier les sources sonores (différents personnages, voix off…), il est recommandé d’utiliser un mécanisme approprié (mise entre crochets, mise en italique, annonce explicite du type “voix off : …”).</p> <p>Note 2 : il ne faut pas confondre le sous-titrage pour la traduction (attribut <code>kind=&quot;subtitles&quot;</code> de la balise <code>&lt;track&gt;</code> en HTML5, par exemple) et le sous-titrage pour sourds et malentendants (attribut <code>kind=&quot;captions&quot;</code> de la balise <code>&lt;track&gt;</code> en HTML5, par exemple). Ces deux types de sous-titrage poursuivent des buts différents. Seule la présence et la pertinence d’un sous-titrage pour sourds et malentendants permet d’être conforme.</p> "
    },
    {
      "title": "Structure du document",
      "body": "<p>Ensemble d’éléments permettant de définir les grandes zones d’une page HTML telles que la zone d’en-tête de la page, les zones de navigation principale et secondaire, la zone de contenu principal et la zone de pied de page.</p> "
    },
    {
      "title": "Système de navigation",
      "body": "<p>Tout procédé permettant une navigation dans le site ou dans une page, les systèmes de navigation retenus sont :</p> <ul> <li>Menu de navigation principal ;</li> <li>Table des matières ;</li> <li>Plan du site ;</li> <li>Moteur de recherche.</li> </ul> "
    },
    {
      "title": "Tableau de données ayant un titre",
      "body": "<p>Tableau de données ayant un attribut ou contenant une balise dont le contenu fait office de titre.</p> <p>Tableau de données précédé ou suivi d’un passage de texte associé au tableau faisant office de titre.</p> <p>Dans la mesure où il est bien correctement restitué et associé par les technologies d’assistance au tableau de données, le titre associé peut être :</p> <ul> <li>Dans une balise <code>&lt;caption&gt;</code> ;</li> <li>Dans un attribut <code>title</code> ;</li> <li>Dans un attribut WAI-ARIA <code>aria-label</code> ;</li> <li>Dans une balise associée au tableau de données via un attribut WAI-ARIA <code>aria-labelledby</code> sur le tableau.</li> </ul> <p>Note : seule la balise <code>&lt;caption&gt;</code> étant complètement supporté par l’ensemble des technologies d’assistance, il est fortement recommandé de privilégier cette solution lors de la mise en œuvre afin d’éviter de nombreuses vérifications dans les différentes combinaisons prévues par l’environnement de test (ou « base de référence »).</p> "
    },
    {
      "title": "Tableau de données complexe",
      "body": "<p>Un tableau de données est une structure introduite par une balise <code>&lt;table&gt;</code> ou lorsqu’il est correctement restitué par les technologies d’assistance par une balise pourvue d’un attribut WAI-ARIA <code>role=&quot;table&quot;</code>.</p> <p>Lorsqu’un tableau de données contient des en-têtes qui ne sont pas répartis uniquement sur la première ligne et/ou la première colonne de la grille ou dont la portée n’est pas valable pour l’ensemble de la colonne ou de la ligne, on parle de tableau de données complexe. Il est alors nécessaire de fournir un « résumé » permettant d’en expliquer sa nature et sa structure afin d’en faciliter la consultation pour des utilisateurs de technologies d’assistance par exemple.</p> "
    },
    {
      "title": "Tableau de données",
      "body": "<p>Un tableau de données est une structure introduite par une balise <code>&lt;table&gt;</code> ou lorsqu’il est correctement restitué par les technologies d’assistance par une balise pourvue d’un attribut WAI-ARIA <code>role=&quot;table&quot;</code>. Cette balise permet de structurer des informations en lignes et en colonnes via des cellules de données et des cellules d’en-têtes.</p> "
    },
    {
      "title": "Tableau de mise en forme",
      "body": "<p>Technique qui utilise un élément HTML (balise <code>&lt;table&gt;</code>) pour contrôler l’affichage d’informations via des cellules (balise <code>&lt;td&gt;</code>).</p> "
    },
    {
      "title": "Taille des caractères",
      "body": "<p>Valeur attribuée aux polices de caractères présentes sur une page web.</p> "
    },
    {
      "title": "Texte stylé",
      "body": "<p>Texte dont la mise en forme est contrôlée par une feuille de styles.</p> "
    },
    {
      "title": "Titre de cadre",
      "body": "<p>Contenu de l’attribut <code>title</code> de la balise <code>&lt;iframe&gt;</code> ou <code>&lt;frame&gt;</code> permettant de connaître la nature du contenu diffusé via le cadre lorsque l’utilisateur navigue de cadre en cadre ou affiche la liste des cadres de la page par exemple.</p> <p>Note 1 : Certains cadres servent uniquement à des opérations techniques tels que des traitements applicatifs destinés à préparer ou piloter des contenus affichés dans la page comme les cadres utilisés par certains réseaux sociaux comme Facebook par exemple.</p> <p>Si ces cadres sont dépourvus de titre de cadre fournis par le service distant, ou si les titres de cadres sont jugés non pertinents, des mentions génériques peuvent être utilisées, par exemple <code>title=&quot;contenus techniques Facebook&quot;</code>.</p> <p>Note 2 : Si cela ne gêne pas le fonctionnement de ce type de cadre, il est possible de les rendre indisponibles aux technologies d’assistance en utilisant l’attribut WAI-ARIA <code>aria-hidden=&quot;true&quot;</code>. Dans ce cas le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#2.1\">critère 2.1</a> et le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#2.2\">critère 2.2</a> seront non applicables.</p> "
    },
    {
      "title": "Titre de page",
      "body": "<p>Contenu de la balise <code>&lt;title&gt;</code> d’une page web permettant d’identifier de manière claire, concise et unique les contenus/la nature de la page (« Plan du site www.nomdusite.fr » pour une page présentant le plan du site web, par exemple).</p> "
    },
    {
      "title": "Titre",
      "body": "<p>Élément HTML (balise  <code>h</code>) à 6 niveaux de hiérarchie (de <code>h1</code> pour le titre le plus important à <code>h6</code> pour le moins important) ou élément HTML ayant les attributs WAI-ARIA <code>role=&quot;heading&quot;</code> et <code>aria-level</code> permettant de structurer l’information d’un contenu web.</p> <p>Assurer une stricte hiérarchie entre les titres d’une page web est une bonne pratique, mais la présence de sauts hiérarchiques n’invalide pas le critère tant que cette hiérarchie plus lâche reste cohérente (un titre <code>&lt;h3&gt;</code> peut ainsi venir directement après un titre <code>&lt;h1&gt;</code>, par exemple). La hiérarchie de titres ne doit pas obligatoirement contenir un titre <code>&lt;h1&gt;</code>.Même si ces pratiques ne sont pas encouragées, elles n’invalident pas le critère.</p> <p>Note : les titres visuellement cachés via CSS sont considérés comme présents et valident le <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#9.1\">critère 9.1</a>.</p> "
    },
    {
      "title": "Transcription textuelle (média temporel)",
      "body": "<p>Contenu textuel associé à un média temporel par la technique appropriée (texte codé en HTML ou dans un fichier texte qui se trouve dans la même page ou consultable suivant un lien). Ce contenu donne accès à l’utilisateur (de manière indépendante de la consultation de l’objet multimédia) à :</p> <ul> <li>La totalité de ce qui y est exprimé oralement ;</li> <li>Toutes les informations descriptives nécessaires à une compréhension équivalente de l’action.</li> </ul> <p>Ces informations textuelles doivent être présentées dans l’ordre chronologique de leur apparition dans le média temporel.</p> <p>Note : la transcription textuelle doit se situer à l’extérieur de la balise <code>&lt;object&gt;</code>.</p> "
    },
    {
      "title": "Type de document",
      "body": "<p>Ensemble de données de référence qui permet aux agents utilisateurs de connaître les caractéristiques techniques des langages utilisés sur la page web (balise <code>doctype</code>).</p> "
    },
    {
      "title": "Type et format de données",
      "body": "<p>Indication concernant le type et le format des données attendus lors de la saisie d’un champ de formulaire. Par exemple :</p> <ul> <li>Date (jj/mm/aaaa) ;</li> <li>Montant en euros ;</li> <li>Code postal (5 chiffres : ex. 75001).</li> </ul> <p>Note importante : lorsque le type de champ de formulaire propose un masque de saisie, par exemple les champs <code>date</code> ou <code>time</code>, l’indication de format n’est pas nécessaire.</p> "
    },
    {
      "title": "Uniquement à des fins de présentation",
      "body": "<p>Uniquement à des fins de présentation : utilisation de balises HTML pour une finalité différente de celle prévue dans les spécifications (au regard du type de document déclaré). Exemples : utilisation des balises <code>h</code> à seule fin de créer un effet typographique ; utilisation de la balise <code>&lt;blockquote&gt;</code> à seule fin de mettre un paragraphe en retrait, etc.</p> <p>Note 1 : l’utilisation d’éléments <code>&lt;div&gt;</code> ou <code>&lt;span&gt;</code> ou plusieurs <code>&lt;br&gt;</code> pour créer visuellement un paragraphe est considérée comme non conforme et invalide le critère.</p> <p>Exemple : <code>&lt;div&gt;</code>, <code>paragraphes d’un bloc de texte simulés</code>, <code>&lt;br&gt;</code>, <code>à l’aide de plusieurs balises &lt;br&gt;</code>, <code>&lt;/div&gt;</code></p> <p>Note 2 : WAI-ARIA propose un rôle <code>presentation</code> permettant de supprimer la sémantique d’un élément, par exemple <code>&lt;h1 role=&quot;presentation&quot;&gt;Titre&lt;/h1&gt;</code>. Dans ce cas, le texte sera correctement restitué mais son rôle de titre ne le sera plus. L’utilisation du rôle <code>presentation</code> peut être requise lorsque l’on utilise un <a href=\"#motif-de-conception\">motif de conception</a> WAI-ARIA.</p> <p>Le rôle WAI-ARIA <code>presentation</code> peut être également utilisé pour supprimer la sémantique d’un élément lorsque ce dernier est utilisé uniquement à des fins de présentation, par exemple <code>&lt;blockquote role=&quot;presentation&quot;&gt;</code> aura le même effet qu’une absence d’élément <code>&lt;blockquote&gt;</code>.</p> <p>Même si cette utilisation est fortement déconseillée (dans le cas de technologie d’assistance qui n’implémenteraient pas WAI-ARIA par exemple) elle peut être considérée comme conforme à <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr>. En revanche l’utilisation d’un rôle WAI-ARIA <code>presentation</code> sur un élément dont la nature (par exemple la sémantique) est essentielle à la compréhension du contenu est une violation des règles <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> (particulièrement de l’échec <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92\">F92</a>) et invalide le critère.</p> "
    },
    {
      "title": "Version accessible (pour un document en téléchargement)",
      "body": "<p>Les documents en téléchargement dont les types de format sont reconnus compatibles avec l’accessibilité doivent être rendus accessibles soit directement soit par l’intermédiaire d’une version accessible ou d’une version en HTML. Les formats de document dont la compatibilité est reconnue sont :</p> <ul> <li>Microsoft Office (Word 2003, OOXML) ;</li> <li>Open Office Org (ODF) ;</li> <li>Adobe PDF ;</li> <li>Epub/Daisy.</li> </ul> <p>Note : le format texte (txt) ne peut pas être utilisé pour produire une version accessible pour un document en téléchargement.</p> "
    },
    {
      "title": "Version alternative « audio seulement »",
      "body": "<p>Une version « audio seulement » est une version sonore, sous la forme d’un simple fichier au format MP3 par exemple, utilisée comme alternative à une vidéo seulement (vidéo sans information sonore). Les seuls utilisateurs impactés par l’accessibilité étant les personnes aveugles, qui ne peuvent pas voir la vidéo, <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> considère comme acceptable de proposer en alternative une version sonore.</p> <p>La version « audio seulement » doit contenir toutes les informations visuelles importantes de la vidéo.</p> <p>Généralement il est plus simple de produire une version sonore qu’une version textuelle lorsque la vidéo est très descriptive (la transcription textuelle nécessitant souvent un travail rédactionnel important). Il est rappelé, néanmoins, que seule la transcription textuelle assure un accès universel aux informations diffusées par la vidéo, dans le cas où un utilisateur ne serait pas en capacité de lancer la vidéo par exemple.</p> "
    },
    {
      "title": "Zone cliquable",
      "body": "<p>Région d’une image réactive à laquelle une action a été associée ; par exemple, le déclenchement d’un événement en cliquant sur un lien (pour une zone cliquable côté client : balise  <code>&lt;area&gt;</code> avec l’attribut <code>href</code>). Les balises <code>&lt;area&gt;</code> sont contenues dans la balise <code>&lt;map&gt;</code>.</p> <p>Pour les images réactives côté serveur, les coordonnées sont détenues sur le serveur.</p> "
    },
    {
      "title": "Zone d’en-tête",
      "body": "<p>Zone située en haut du document et contenant généralement le titre du document, un logo, un slogan…</p> <p>Note : Attention à ne pas confondre cette zone d’en-tête, unique dans le site, avec tout contenu pouvant être balisé en HTML5 avec l’élément <code>&lt;header&gt;</code>.</p> <p>Voir la définition technique fournie par WAI-ARIA : <a href=\"https://www.w3.org/TR/wai-aria-1.1/#banner\">Banner (role)</a>.</p> "
    },
    {
      "title": "Zone (d’une image réactive)",
      "body": "<p>Zone cliquable ou zone non cliquable d’une image réactive côté client ou zone cliquable d’une image réactive côté serveur.</p> "
    },
    {
      "title": "Zone de contenu principal",
      "body": "<p>Zone contenant les principaux contenus de la page, là où se trouvent les informations et fonctionnalités de fond (donc en dehors des menus, de la recherche ou des zones secondaires de publicités, actualités connexes…).</p> <p>Note : Cette zone est unique dans la page. Elle peut être difficile à déterminer sur certaines pages particulières, comme la page d’accueil.</p> <p>Voir la définition technique fournie par WAI-ARIA : <a href=\"https://www.w3.org/TR/wai-aria-1.1/#main\">Main (role)</a>.</p> "
    },
    {
      "title": "Zone de pied de page",
      "body": "<p>Il s’agit des informations concernant le fonctionnement du site ou les informations légales. On y trouve par exemple les mentions légales, les crédits, les conditions d’utilisation, le plan du site et éventuellement la page accessibilité.</p> <p>Note : Attention à ne pas confondre cette zone de pied de page, unique dans le site, avec tout contenu pouvant être balisé en HTML5 avec l’élément <code>&lt;footer&gt;</code>.</p> <p>Voir la définition technique fournie par WAI-ARIA : <a href=\"https://www.w3.org/TR/wai-aria-1.1/#contentinfo\">Contentinfo (role)</a>.</p> "
    },
    {
      "title": "Zone non cliquable",
      "body": "<p>Région d’une image réactive à laquelle aucune action n’est associée. Une zone non cliquable côté client est contenue dans une balise <code>&lt;area&gt;</code> :</p> <ul> <li>Avec l’attribut <code>nohref</code> lorsque le code HTML de la page n’est pas du HTML5 ;</li> <li>Sans attribut <code>href</code> en HTML5.</li> </ul> <p>Les balises <code>&lt;area&gt;</code> sont contenus dans la balise <code>&lt;map&gt;</code>.</p> "
    }
  ]
}